iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
};

#define System_Control_Space_NVIC (*(volatile struct System_Control_Space_NVIC_tag *) 0xe000e100)

struct System_Control_Space_SysTick_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t TICKINT:1;
      uint64_t CLKSOURCE:1;
      uint64_t reservedSpace0:13;
      uint64_t COUNTFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RELOAD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_RVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURRENT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TENMS:24;
      uint64_t reservedSpace0:6;
      uint64_t SKEW:1;
      uint64_t NOREF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CALIB;

};

#define System_Control_Space_SysTick (*(volatile struct System_Control_Space_SysTick_tag *) 0xe000e010)

struct System_Control_Space_Memory_Protection_Unit_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEPARATE:1;
      uint64_t reservedSpace0:7;
      uint64_t DREGION:8;
      uint64_t IREGION:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_TYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t HFNMIENA:1;
      uint64_t PRIVDEFENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_CTRL;

  uint8_t MPU_RNR;
  uint8_t res0[3];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
      uint64_t ADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR_A1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR_A1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR_A2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR_A2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR_A3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR_A3;

};

#define System_Control_Space_Memory_Protection_Unit (*(volatile struct System_Control_Space_Memory_Protection_Unit_tag *) 0xe000ed90)

struct SYSCON_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_ICODE:2;
      uint64_t PRI_DCODE:2;
      uint64_t PRI_SYS:2;
      uint64_t PRI_DMA:4;
      uint64_t PRI_ETH:2;
      uint64_t PRI_LCD:2;
      uint64_t PRI_USB0:2;
      uint64_t PRI_USB1:2;
      uint64_t PRI_SDIO:2;
      uint64_t PRI_MCAN1:2;
      uint64_t PRI_MCAN2:2;
      uint64_t PRI_SHA:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBMATPRIO;

  uint8_t res0[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAL:24;
      uint64_t SKEW:1;
      uint64_t NOREF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSTCKCAL;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQM4:6;
      uint64_t reservedSpace0:25;
      uint64_t NMIENM4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NMISRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ASYNCAPBCTRL;

  uint8_t res2[112];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIOPORCAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIOPORCAP_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIOPORCAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIOPORCAP_1;

  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIORESCAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIORESCAP_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIORESCAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIORESCAP_1;

  uint8_t res4[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t FLASH_RST:1;
      uint64_t FMC_RST:1;
      uint64_t EEPROM_RST:1;
      uint64_t SPIFI_RST:1;
      uint64_t MUX_RST:1;
      uint64_t reservedSpace1:1;
      uint64_t IOCON_RST:1;
      uint64_t GPIO0_RST:1;
      uint64_t GPIO1_RST:1;
      uint64_t GPIO2_RST:1;
      uint64_t GPIO3_RST:1;
      uint64_t PINT_RST:1;
      uint64_t GINT_RST:1;
      uint64_t DMA0_RST:1;
      uint64_t CRC_RST:1;
      uint64_t WWDT_RST:1;
      uint64_t reservedSpace2:4;
      uint64_t ADC0_RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRESETCTRL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MRT_RST:1;
      uint64_t reservedSpace0:1;
      uint64_t SCT0_RST:1;
      uint64_t reservedSpace1:4;
      uint64_t MCAN0_RST:1;
      uint64_t MCAN1_RST:1;
      uint64_t reservedSpace2:1;
      uint64_t UTICK_RST:1;
      uint64_t FC0_RST:1;
      uint64_t FC1_RST:1;
      uint64_t FC2_RST:1;
      uint64_t FC3_RST:1;
      uint64_t FC4_RST:1;
      uint64_t FC5_RST:1;
      uint64_t FC6_RST:1;
      uint64_t FC7_RST:1;
      uint64_t DMIC_RST:1;
      uint64_t reservedSpace3:2;
      uint64_t CTIMER2_RST:1;
      uint64_t reservedSpace4:2;
      uint64_t USB0D_RST:1;
      uint64_t CTIMER0_RST:1;
      uint64_t CTIMER1_RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRESETCTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t LCD_RST:1;
      uint64_t SDIO_RST:1;
      uint64_t USB1H_RST:1;
      uint64_t USB1D_RST:1;
      uint64_t USB1RAM_RST:1;
      uint64_t EMC_RESET:1;
      uint64_t ETH_RST:1;
      uint64_t GPIO4_RST:1;
      uint64_t GPIO5_RST:1;
      uint64_t AES_RST:1;
      uint64_t OTP_RST:1;
      uint64_t RNG_RST:1;
      uint64_t FC8_RST:1;
      uint64_t FC9_RST:1;
      uint64_t USB0HMR_RST:1;
      uint64_t USB0HSL_RST:1;
      uint64_t SHA_RST:1;
      uint64_t SC0_RST:1;
      uint64_t SC1_RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRESETCTRL2;

