iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
  uint8_t res5[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RST_SET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRESETCTRLSET_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RST_SET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRESETCTRLSET_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RST_SET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRESETCTRLSET_2;

  uint8_t res6[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RST_CLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRESETCTRLCLR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RST_CLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRESETCTRLCLR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RST_CLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRESETCTRLCLR_2;

  uint8_t res7[164];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POR:1;
      uint64_t EXTRST:1;
      uint64_t WDT:1;
      uint64_t BOD:1;
      uint64_t SYSRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSRSTSTAT;

  uint8_t res8[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ROM:1;
      uint64_t reservedSpace1:1;
      uint64_t SRAM1:1;
      uint64_t SRAM2:1;
      uint64_t SRAM3:1;
      uint64_t reservedSpace2:1;
      uint64_t FLASH:1;
      uint64_t FMC_bitfield:1;
      uint64_t EEPROM_bitfield:1;
      uint64_t SPIFI:1;
      uint64_t INPUTMUX:1;
      uint64_t reservedSpace3:1;
      uint64_t IOCON_bitfield:1;
      uint64_t GPIO0:1;
      uint64_t GPIO1:1;
      uint64_t GPIO2:1;
      uint64_t GPIO3:1;
      uint64_t PINT_bitfield:1;
      uint64_t GINT:1;
      uint64_t DMA:1;
      uint64_t CRC:1;
      uint64_t WWDT_bitfield:1;
      uint64_t RTC_bitfield:1;
      uint64_t reservedSpace4:3;
      uint64_t ADC0_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBCLKCTRL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MRT:1;
      uint64_t RIT_bitfield:1;
      uint64_t SCT0:1;
      uint64_t reservedSpace0:4;
      uint64_t MCAN0:1;
      uint64_t MCAN1:1;
      uint64_t reservedSpace1:1;
      uint64_t UTICK:1;
      uint64_t FLEXCOMM0_bitfield:1;
      uint64_t FLEXCOMM1_bitfield:1;
      uint64_t FLEXCOMM2_bitfield:1;
      uint64_t FLEXCOMM3_bitfield:1;
      uint64_t FLEXCOMM4_bitfield:1;
      uint64_t FLEXCOMM5_bitfield:1;
      uint64_t FLEXCOMM6_bitfield:1;
      uint64_t FLEXCOMM7_bitfield:1;
      uint64_t DMIC:1;
      uint64_t reservedSpace2:2;
      uint64_t CTIMER2_bitfield:1;
      uint64_t reservedSpace3:2;
      uint64_t USB0_bitfield:1;
      uint64_t CTIMER0_bitfield:1;
      uint64_t CTIMER1_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBCLKCTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t LCD_bitfield:1;
      uint64_t SDIO_bitfield:1;
      uint64_t USB1H:1;
      uint64_t USB1D:1;
      uint64_t USB1RAM:1;
      uint64_t EMC_bitfield:1;
      uint64_t ETH:1;
      uint64_t GPIO4:1;
      uint64_t GPIO5:1;
      uint64_t AES:1;
      uint64_t OTP:1;
      uint64_t RNG:1;
      uint64_t FLEXCOMM8_bitfield:1;
      uint64_t FLEXCOMM9_bitfield:1;
      uint64_t USB0HMR:1;
      uint64_t USB0HSL:1;
      uint64_t SHA0:1;
      uint64_t SC0:1;
      uint64_t SC1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBCLKCTRL2;

  uint8_t res9[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_SET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBCLKCTRLSET_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_SET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBCLKCTRLSET_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_SET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBCLKCTRLSET_2;

  uint8_t res10[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_CLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBCLKCTRLCLR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_CLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBCLKCTRLCLR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_CLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBCLKCTRLCLR_2;

  uint8_t res11[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAINCLKSELA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAINCLKSELB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKOUTSELA;

  uint8_t res12[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSPLLCLKSEL;

  uint8_t res13[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUDPLLCLKSEL;

  uint8_t res14[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIFICLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADCCLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB0CLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB1CLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCLKSEL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCLKSEL_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCLKSEL_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCLKSEL_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCLKSEL_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCLKSEL_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCLKSEL_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCLKSEL_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCLKSEL_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCLKSEL_9;

  uint8_t res15[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCLKCLKSEL;

  uint8_t res16[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRGCLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMICCLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCTCLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDCLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDIOCLKSEL;

  uint8_t res17[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSTICKCLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARMTRCLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0CLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1CLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SC0CLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SC1CLKDIV;

  uint8_t res18[104];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBCLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKOUTDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FROHFCLKDIV;

  uint8_t res19[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIFICLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADCCLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB0CLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB1CLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t MULT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRGCTRL;

  uint8_t res20[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMICCLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDCLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCTCLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMCCLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDIOCLKDIV;

