iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
  uint8_t res21[64];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FETCHCFG:2;
      uint64_t DATACFG:2;
      uint64_t ACCEL:1;
      uint64_t PREFEN:1;
      uint64_t PREFOVR:1;
      uint64_t reservedSpace0:5;
      uint64_t FLASHTIM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASHCFG;

  uint8_t res22[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AP_FS_DEV_CLK:1;
      uint64_t POL_FS_DEV_CLK:1;
      uint64_t AP_FS_HOST_CLK:1;
      uint64_t POL_FS_HOST_CLK:1;
      uint64_t PU_DISABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB0CLKCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEV_NEED_CLKST:1;
      uint64_t HOST_NEED_CLKST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB0CLKSTAT;

  uint8_t res23[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPVAL:14;
      uint64_t reservedSpace0:17;
      uint64_t PROG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FREQMECTRL;

  uint8_t res24[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCLKIO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AP_FS_DEV_CLK:1;
      uint64_t POL_FS_DEV_CLK:1;
      uint64_t AP_FS_HOST_CLK:1;
      uint64_t POL_FS_HOST_CLK:1;
      uint64_t HS_DEV_WAKEUP_N:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB1CLKCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEV_NEED_CLKST:1;
      uint64_t HOST_NEED_CLKST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB1CLKSTAT;

  uint8_t res25[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMCSC:1;
      uint64_t EMCRD:1;
      uint64_t EMCBC:1;
      uint64_t EMCFBCLKINSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMCSYSCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMD_DELAY:5;
      uint64_t reservedSpace0:3;
      uint64_t FBCLK_DELAY:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMCDLYCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CALVALUE:8;
      uint64_t reservedSpace0:6;
      uint64_t START:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMCDLYCAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PHY_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETHPHYSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SBD_CTRL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETHSBDCTRL;

  uint8_t res26[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCLK_DRV_PHASE:2;
      uint64_t CCLK_SAMPLE_PHASE:2;
      uint64_t reservedSpace0:3;
      uint64_t PHASE_ACTIVE:1;
      uint64_t reservedSpace1:8;
      uint64_t CCLK_DRV_DELAY:5;
      uint64_t reservedSpace2:2;
      uint64_t CCLK_DRV_DELAY_ACTIVE:1;
      uint64_t CCLK_SAMPLE_DELAY:5;
      uint64_t reservedSpace3:2;
      uint64_t CCLK_SAMPLE_DELAY_ACTIVE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDIOCLKCTRL;

  uint8_t res27[156];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIM:14;
      uint64_t SEL:1;
      uint64_t reservedSpace0:1;
      uint64_t FREQTRIM:8;
      uint64_t USBCLKADJ:1;
      uint64_t USBMODCHG:1;
      uint64_t reservedSpace1:4;
      uint64_t HSPDCLK:1;
      uint64_t WRTRIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FROCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BYPASS:1;
      uint64_t FREQRANGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSOSCCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVSEL:5;
      uint64_t FREQSEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDTOSCCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTCOSCCTRL;

  uint8_t res28[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSEL:8;
      uint64_t PSEL:2;
      uint64_t NSEL:2;
      uint64_t DIRECT:1;
      uint64_t BYPASS:1;
      uint64_t BYPASSCCODIV2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USBPLLCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USBPLLSTAT;

  uint8_t res29[92];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SELR:4;
      uint64_t SELI:6;
      uint64_t SELP:5;
      uint64_t BYPASS:1;
      uint64_t reservedSpace0:1;
      uint64_t UPLIMOFF:1;
      uint64_t reservedSpace1:1;
      uint64_t DIRECTI:1;
      uint64_t DIRECTO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSPLLCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSPLLSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NDEC:10;
      uint64_t NREQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSPLLNDEC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDEC:7;
      uint64_t PREQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSPLLPDEC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDEC:17;
      uint64_t MREQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSPLLMDEC;

  uint8_t res30[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SELR:4;
      uint64_t SELI:6;
      uint64_t SELP:5;
      uint64_t BYPASS:1;
      uint64_t reservedSpace0:1;
      uint64_t UPLIMOFF:1;
      uint64_t reservedSpace1:1;
      uint64_t DIRECTI:1;
      uint64_t DIRECTO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUDPLLCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUDPLLSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NDEC:10;
      uint64_t NREQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUDPLLNDEC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDEC:7;
      uint64_t PREQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUDPLLPDEC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDEC:17;
      uint64_t MREQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUDPLLMDEC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTRL:22;
      uint64_t REQ:1;
      uint64_t SEL_EXT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUDPLLFRAC;

  uint8_t res31[88];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PDEN_FRO:1;
      uint64_t reservedSpace1:1;
      uint64_t PDEN_TS:1;
      uint64_t PDEN_BOD_RST:1;
      uint64_t PDEN_BOD_INTR:1;
      uint64_t PDEN_VD2_ANA:1;
      uint64_t PDEN_ADC0:1;
      uint64_t PDEN_EEPROM:2;
      uint64_t PDEN_SRAM0:1;
      uint64_t PDEN_SRAM1:1;
      uint64_t PDEN_SRAM2:1;
      uint64_t PDEN_SRAM3:1;
      uint64_t PDEN_ROM:1;
      uint64_t reservedSpace2:1;
      uint64_t PDEN_VDDA:1;
      uint64_t PDEN_WDT_OSC:1;
      uint64_t PDEN_USB0_PHY:1;
      uint64_t PDEN_SYS_PLL:1;
      uint64_t PDEN_VREFP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDRUNCFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDEN_USB1PHY:1;
      uint64_t PDEN_USBPLL:1;
      uint64_t PDEN_AUD_PLL:1;
      uint64_t PDEN_SYSOSC:1;
      uint64_t reservedSpace0:3;
      uint64_t PDEN_RNG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDRUNCFG1;

