iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
  uint8_t res32[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD_SET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDRUNCFGSET_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD_SET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDRUNCFGSET_1;

  uint8_t res33[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD_CLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDRUNCFGCLR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD_CLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDRUNCFGCLR_1;

  uint8_t res34[72];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDT_BOD:1;
      uint64_t DMA:1;
      uint64_t GINT0_bitfield:1;
      uint64_t GINT1_bitfield:1;
      uint64_t PIN_INT0:1;
      uint64_t PIN_INT1:1;
      uint64_t PIN_INT2:1;
      uint64_t PIN_INT3:1;
      uint64_t UTICK:1;
      uint64_t MRT:1;
      uint64_t CTIMER0_bitfield:1;
      uint64_t CTIMER1_bitfield:1;
      uint64_t SCT0:1;
      uint64_t CTIMER3_bitfield:1;
      uint64_t FLEXCOMM0_bitfield:1;
      uint64_t FLEXCOMM1_bitfield:1;
      uint64_t FLEXCOMM2_bitfield:1;
      uint64_t FLEXCOMM3_bitfield:1;
      uint64_t FLEXCOMM4_bitfield:1;
      uint64_t FLEXCOMM5_bitfield:1;
      uint64_t FLEXCOMM6_bitfield:1;
      uint64_t FLEXCOMM7_bitfield:1;
      uint64_t ADC0_SEQA:1;
      uint64_t ADC0_SEQB:1;
      uint64_t ADC0_THCMP:1;
      uint64_t DMIC:1;
      uint64_t HWVAD:1;
      uint64_t USB0_NEEDCLK:1;
      uint64_t USB0_bitfield:1;
      uint64_t RTC_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STARTER0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINT4:1;
      uint64_t PINT5:1;
      uint64_t PINT6:1;
      uint64_t PINT7:1;
      uint64_t CTIMER2_bitfield:1;
      uint64_t CTIMER4_bitfield:1;
      uint64_t reservedSpace0:2;
      uint64_t FC8:1;
      uint64_t FC9:1;
      uint64_t reservedSpace1:5;
      uint64_t USB1:1;
      uint64_t USB1_ACT:1;
      uint64_t ENET_INT1:1;
      uint64_t ENET_INT2:1;
      uint64_t ENET_INT0:1;
      uint64_t reservedSpace2:3;
      uint64_t SCI0:1;
      uint64_t SCI1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STARTER1;

  uint8_t res35[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START_SET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STARTERSET_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START_SET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STARTERSET_1;

  uint8_t res36[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START_CLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STARTERCLR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START_CLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STARTERCLR_1;

  uint8_t res37[184];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FORCEWAKE:1;
      uint64_t FCWAKE:1;
      uint64_t WAKEDMIC:1;
      uint64_t WAKEDMA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWWAKE;

  uint8_t res38[2160];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JTAGID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) JTAGIDCODE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARTID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEVICE_ID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REVID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEVICE_ID1;

  uint8_t res39[127044];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BODRSTLEV:2;
      uint64_t BODRSTENA:1;
      uint64_t BODINTLEV:2;
      uint64_t BODINTENA:1;
      uint64_t BODRSTSTAT:1;
      uint64_t BODINTSTAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BODCTRL;

};

#define SYSCON (*(volatile struct SYSCON_tag *) 0x40000010)

struct IOCON_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO00;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO01;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO02;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO03;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO04;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO05;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO06;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO07;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO08;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO09;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t reservedSpace1:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO010;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO011;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO012;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t reservedSpace0:2;
      uint64_t I2CSLEW:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t I2CDRIVE:1;
      uint64_t I2CFILTER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO013;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t reservedSpace0:2;
      uint64_t I2CSLEW:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t I2CDRIVE:1;
      uint64_t I2CFILTER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO014;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t reservedSpace1:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO015;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t reservedSpace1:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO016;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO017;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO018;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO019;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO020;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO021;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO022;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t reservedSpace1:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO023;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO024;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO025;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO026;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO027;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO028;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO029;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO030;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t reservedSpace1:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO031;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t reservedSpace1:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO110;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO111;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO112;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO113;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO114;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO115;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO116;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO117;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO118;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO119;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO120;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO121;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO122;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO123;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO124;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO125;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO126;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO127;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO128;

