iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO129;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO130;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO131;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t reservedSpace1:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t reservedSpace1:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO210;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO211;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO212;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO213;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO214;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO215;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO216;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO217;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO218;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO219;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO220;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO221;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO222;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO223;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO224;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO225;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO226;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO227;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO228;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO229;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO230;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO231;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO310;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO311;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO312;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO313;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO314;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO315;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO316;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO317;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO318;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO319;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO320;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t reservedSpace1:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO321;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t reservedSpace1:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO322;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t reservedSpace0:2;
      uint64_t I2CSLEW:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t I2CDRIVE:1;
      uint64_t I2CFILTER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO323;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t reservedSpace0:2;
      uint64_t I2CSLEW:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t I2CDRIVE:1;
      uint64_t I2CFILTER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO324;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO325;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO326;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO327;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO328;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO329;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO330;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO331;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO46;

