iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO410;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO411;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO412;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO413;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO414;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO415;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO416;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO417;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO418;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO419;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO420;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO421;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO422;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO423;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO424;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO425;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO426;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO427;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO428;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO429;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO430;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:4;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t INVERT:1;
      uint64_t DIGIMODE:1;
      uint64_t FILTEROFF:1;
      uint64_t SLEW:1;
      uint64_t OD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO431;

