iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
};

#define IOCON (*(volatile struct IOCON_tag *) 0x40001000)

struct GINT0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT:1;
      uint64_t COMB:1;
      uint64_t TRIG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  uint8_t res0[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_POL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_POL_1;

  uint8_t res1[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_ENA_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_ENA_1;

};

#define GINT0 (*(volatile struct GINT0_tag *) 0x40002000)

struct GINT1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT:1;
      uint64_t COMB:1;
      uint64_t TRIG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  uint8_t res0[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_POL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_POL_1;

  uint8_t res1[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_ENA_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_ENA_1;

};

#define GINT1 (*(volatile struct GINT1_tag *) 0x40003000)

struct PINT_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PMODE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENRL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENRL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CENRL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENAF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IENF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENAF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIENF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CENAF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIENF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RISE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FDET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FALL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSTAT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_PMATCH:1;
      uint64_t ENA_RXEV:1;
      uint64_t reservedSpace0:22;
      uint64_t PMAT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t SRC0:3;
      uint64_t SRC1:3;
      uint64_t SRC2:3;
      uint64_t SRC3:3;
      uint64_t SRC4:3;
      uint64_t SRC5:3;
      uint64_t SRC6:3;
      uint64_t SRC7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMSRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROD_ENDPTS0:1;
      uint64_t PROD_ENDPTS1:1;
      uint64_t PROD_ENDPTS2:1;
      uint64_t PROD_ENDPTS3:1;
      uint64_t PROD_ENDPTS4:1;
      uint64_t PROD_ENDPTS5:1;
      uint64_t PROD_ENDPTS6:1;
      uint64_t reservedSpace0:1;
      uint64_t CFG0:3;
      uint64_t CFG1:3;
      uint64_t CFG2:3;
      uint64_t CFG3:3;
      uint64_t CFG4:3;
      uint64_t CFG5:3;
      uint64_t CFG6:3;
      uint64_t CFG7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMCFG;

};

#define PINT (*(volatile struct PINT_tag *) 0x40004000)

struct INPUT_MUX_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP_N:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCT0_INMUX_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP_N:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCT0_INMUX_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP_N:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCT0_INMUX_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP_N:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCT0_INMUX_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP_N:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCT0_INMUX_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP_N:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCT0_INMUX_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP_N:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCT0_INMUX_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP_N:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCT0_INMUX_7;

  uint8_t res0[160];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTPIN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINTSEL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTPIN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINTSEL_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTPIN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINTSEL_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTPIN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINTSEL_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTPIN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINTSEL_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTPIN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINTSEL_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTPIN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINTSEL_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTPIN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINTSEL_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_ITRIG_INMUX_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_ITRIG_INMUX_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_ITRIG_INMUX_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_ITRIG_INMUX_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_ITRIG_INMUX_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_ITRIG_INMUX_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_ITRIG_INMUX_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_ITRIG_INMUX_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_ITRIG_INMUX_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_ITRIG_INMUX_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_ITRIG_INMUX_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_ITRIG_INMUX_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_ITRIG_INMUX_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_ITRIG_INMUX_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_ITRIG_INMUX_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_ITRIG_INMUX_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_ITRIG_INMUX_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_ITRIG_INMUX_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_ITRIG_INMUX_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_ITRIG_INMUX_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_ITRIG_INMUX_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_ITRIG_INMUX_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_ITRIG_INMUX_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_ITRIG_INMUX_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_ITRIG_INMUX_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_ITRIG_INMUX_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_ITRIG_INMUX_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_ITRIG_INMUX_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_ITRIG_INMUX_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_ITRIG_INMUX_29;

