iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
};

#define CTIMER1 (*(volatile struct CTIMER1_tag *) 0x40009000)

struct WWDT_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDEN:1;
      uint64_t WDRESET:1;
      uint64_t WDTOF:1;
      uint64_t WDINT:1;
      uint64_t WDPROTECT:1;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TV;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WARNINT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WARNINT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WINDOW:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WINDOW;

};

#define WWDT (*(volatile struct WWDT_tag *) 0x4000c000)

struct MRT0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOC:4;
      uint64_t NOB:5;
      uint64_t reservedSpace0:22;
      uint64_t MULTITASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t CHAN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDLE_CH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GFLAG0:1;
      uint64_t GFLAG1:1;
      uint64_t GFLAG2:1;
      uint64_t GFLAG3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ_FLAG;

};

#define MRT0 (*(volatile struct MRT0_tag *) 0x4000d0f0)

struct MRT0_CHANNEL_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IVALUE:24;
      uint64_t reservedSpace0:7;
      uint64_t LOAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTEN:1;
      uint64_t MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTFLAG:1;
      uint64_t RUN:1;
      uint64_t INUSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

};

#define MRT0_CHANNEL_0 (*(volatile struct MRT0_CHANNEL_0_tag *) 0x4000d000)

struct MRT0_CHANNEL_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IVALUE:24;
      uint64_t reservedSpace0:7;
      uint64_t LOAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTEN:1;
      uint64_t MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTFLAG:1;
      uint64_t RUN:1;
      uint64_t INUSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

};

#define MRT0_CHANNEL_1 (*(volatile struct MRT0_CHANNEL_1_tag *) 0x4000d010)

struct MRT0_CHANNEL_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IVALUE:24;
      uint64_t reservedSpace0:7;
      uint64_t LOAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTEN:1;
      uint64_t MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTFLAG:1;
      uint64_t RUN:1;
      uint64_t INUSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

};

#define MRT0_CHANNEL_2 (*(volatile struct MRT0_CHANNEL_2_tag *) 0x4000d020)

struct MRT0_CHANNEL_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IVALUE:24;
      uint64_t reservedSpace0:7;
      uint64_t LOAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTEN:1;
      uint64_t MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTFLAG:1;
      uint64_t RUN:1;
      uint64_t INUSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

};

#define MRT0_CHANNEL_3 (*(volatile struct MRT0_CHANNEL_3_tag *) 0x4000d030)

struct UTICK0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DELAYVAL:31;
      uint64_t REPEAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTR:1;
      uint64_t ACTIVE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPEN0:1;
      uint64_t CAPEN1:1;
      uint64_t CAPEN2:1;
      uint64_t CAPEN3:1;
      uint64_t reservedSpace0:4;
      uint64_t CAPPOL0:1;
      uint64_t CAPPOL1:1;
      uint64_t CAPPOL2:1;
      uint64_t CAPPOL3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPCLR0:1;
      uint64_t CAPCLR1:1;
      uint64_t CAPCLR2:1;
      uint64_t CAPCLR3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAPCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP_VALUE:31;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP_VALUE:31;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP_VALUE:31;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP_VALUE:31;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP_3;

