iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
};

#define UTICK0 (*(volatile struct UTICK0_tag *) 0x4000e000)

struct EEPROM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMD:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RPHASE2:8;
      uint64_t RPHASE1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RWSTATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AUTOPROG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUTOPROG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PHASE3:8;
      uint64_t PHASE2:8;
      uint64_t PHASE1:8;
      uint64_t reservedSpace0:7;
      uint64_t LCK_PARWEP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WSTATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKDIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWRDWN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWRDWN;

  uint8_t res1[4028];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PROG_CLR_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PROG_SET_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t END_OF_PROG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t EE_PROG_DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PROG_CLR_ST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTATCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PROG_SET_ST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTATSET;

};

#define EEPROM (*(volatile struct EEPROM_tag *) 0x40014000)

struct OTPC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESKEY_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESKEY_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESKEY_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESKEY_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESKEY_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESKEY_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESKEY_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESKEY_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t CRP_MASS_ERASE_DISABLE:1;
      uint64_t IAP_PROTECTION_ENABLE:1;
      uint64_t CRP_ISP_DISABLE_PIN:1;
      uint64_t CRP_ISP_DISABLE_IAP:1;
      uint64_t reservedSpace1:1;
      uint64_t CRP_ALLOW_ZERO:1;
      uint64_t reservedSpace2:21;
      uint64_t JTAG_DISABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECRP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t NXP_CERTIFICATE:1;
      uint64_t OTP_PUBLIC_KEY:1;
      uint64_t SIGNATURE_PREFORMAT:1;
      uint64_t reservedSpace1:10;
      uint64_t PUBLIC_KEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGNEDIMAGE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USER0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USER0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USER1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USER1;

};

#define OTPC (*(volatile struct OTPC_tag *) 0x40015010)

struct CTIMER2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MR0INT:1;
      uint64_t MR1INT:1;
      uint64_t MR2INT:1;
      uint64_t MR3INT:1;
      uint64_t CR0INT:1;
      uint64_t CR1INT:1;
      uint64_t CR2INT:1;
      uint64_t CR3INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
      uint64_t CRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MR0I:1;
      uint64_t MR0R:1;
      uint64_t MR0S:1;
      uint64_t MR1I:1;
      uint64_t MR1R:1;
      uint64_t MR1S:1;
      uint64_t MR2I:1;
      uint64_t MR2R:1;
      uint64_t MR2S:1;
      uint64_t MR3I:1;
      uint64_t MR3R:1;
      uint64_t MR3S:1;
      uint64_t reservedSpace0:12;
      uint64_t MR0RL:1;
      uint64_t MR1RL:1;
      uint64_t MR2RL:1;
      uint64_t MR3RL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP0RE:1;
      uint64_t CAP0FE:1;
      uint64_t CAP0I:1;
      uint64_t CAP1RE:1;
      uint64_t CAP1FE:1;
      uint64_t CAP1I:1;
      uint64_t CAP2RE:1;
      uint64_t CAP2FE:1;
      uint64_t CAP2I:1;
      uint64_t CAP3RE:1;
      uint64_t CAP3FE:1;
      uint64_t CAP3I:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EM0:1;
      uint64_t EM1:1;
      uint64_t EM2:1;
      uint64_t EM3:1;
      uint64_t EMC0:2;
      uint64_t EMC1:2;
      uint64_t EMC2:2;
      uint64_t EMC3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMR;

  uint8_t res0[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTMODE:2;
      uint64_t CINSEL:2;
      uint64_t ENCC:1;
      uint64_t SELCC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWMEN0:1;
      uint64_t PWMEN1:1;
      uint64_t PWMEN2:1;
      uint64_t PWMEN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWMC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR_3;

