iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
};

#define CTIMER2 (*(volatile struct CTIMER2_tag *) 0x40028000)

struct RTC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRESET:1;
      uint64_t reservedSpace0:1;
      uint64_t ALARM1HZ:1;
      uint64_t WAKE1KHZ:1;
      uint64_t ALARMDPD_EN:1;
      uint64_t WAKEDPD_EN:1;
      uint64_t RTC1KHZ_EN:1;
      uint64_t RTC_EN:1;
      uint64_t RTC_OSC_PD:1;
      uint64_t RTC_OSC_BYPASS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATCH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COUNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WAKE;

  uint8_t res0[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPREG_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPREG_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPREG_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPREG_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPREG_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPREG_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPREG_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPREG_7;

};

#define RTC (*(volatile struct RTC_tag *) 0x4002c000)

struct RIT_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RICOMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMPVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RIMASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RITINT:1;
      uint64_t RITENCLR:1;
      uint64_t RITENBR:1;
      uint64_t RITEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RICOUNTER:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COUNTER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RICOMP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMPVAL_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RIMASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK_H;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RICOUNTER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COUNTER_H;

};

#define RIT (*(volatile struct RIT_tag *) 0x4002d000)

struct FMC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t FS_RD0:1;
      uint64_t FS_RD1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCTR;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITSTATES:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FBWST;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMSSTART;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STOP:17;
      uint64_t SIG_START:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMSSTOP;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SW:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMSW_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SW:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMSW_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SW:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMSW_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SW:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMSW_3;

  uint8_t res3[4004];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t SIG_DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMSTAT;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t SIG_DONE_CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMSTATCLR;

};

#define FMC (*(volatile struct FMC_tag *) 0x40034000)

struct ASYNC_SYSCON_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:13;
      uint64_t CTIMER3_bitfield:1;
      uint64_t CTIMER4_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ASYNCPRESETCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARST_SET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ASYNCPRESETCTRLSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARST_CLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ASYNCPRESETCTRLCLR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:13;
      uint64_t CTIMER3_bitfield:1;
      uint64_t CTIMER4_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ASYNCAPBCLKCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACLK_SET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ASYNCAPBCLKCTRLSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACLK_CLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ASYNCAPBCLKCTRLCLR;

