iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
};

#define CTIMER4 (*(volatile struct CTIMER4_tag *) 0x40049000)

struct SPIFI0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMEOUT:16;
      uint64_t CSHIGH:4;
      uint64_t reservedSpace0:1;
      uint64_t D_PRFTCH_DIS:1;
      uint64_t INTEN:1;
      uint64_t MODE3:1;
      uint64_t reservedSpace1:3;
      uint64_t PRFTCH_DIS:1;
      uint64_t DUAL:1;
      uint64_t RFCLK:1;
      uint64_t FBCLK:1;
      uint64_t DMAEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATALEN:14;
      uint64_t POLL:1;
      uint64_t DOUT:1;
      uint64_t INTLEN:3;
      uint64_t FIELDFORM:2;
      uint64_t FRAMEFORM:3;
      uint64_t OPCODE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRESS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLIMIT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLIMIT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:14;
      uint64_t POLL:1;
      uint64_t DOUT:1;
      uint64_t INTLEN:3;
      uint64_t FIELDFORM:2;
      uint64_t FRAMEFORM:3;
      uint64_t OPCODE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCINIT:1;
      uint64_t CMD:1;
      uint64_t reservedSpace0:2;
      uint64_t RESET:1;
      uint64_t INTRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

};

#define SPIFI0 (*(volatile struct SPIFI0_tag *) 0x40080000)

struct EMC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t E:1;
      uint64_t M:1;
      uint64_t L:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:1;
      uint64_t S:1;
      uint64_t SA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EM:1;
      uint64_t reservedSpace0:7;
      uint64_t CLKR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG;

  uint8_t res0[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CE:1;
      uint64_t CS:1;
      uint64_t SR:1;
      uint64_t reservedSpace0:2;
      uint64_t MMC:1;
      uint64_t reservedSpace1:1;
      uint64_t I:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICCONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REFRESH:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICREFRESH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICREADCONFIG;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICRP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRAS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICRAS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSREX:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICSREX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAPR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICAPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDAL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICDAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TWR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICWR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRC:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRFC:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICRFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXSR:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICXSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRRD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICRRD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TMRD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICMRD;

  uint8_t res2[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTENDEDWAIT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICEXTENDEDWAIT;

};

#define EMC (*(volatile struct EMC_tag *) 0x40081000)

struct EMC_DYNAMIC_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t MD:2;
      uint64_t reservedSpace1:2;
      uint64_t AM0:6;
      uint64_t reservedSpace2:1;
      uint64_t AM1:1;
      uint64_t reservedSpace3:4;
      uint64_t B:1;
      uint64_t P:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICCONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAS:2;
      uint64_t reservedSpace0:6;
      uint64_t CAS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICRASCAS;

};

#define EMC_DYNAMIC_0 (*(volatile struct EMC_DYNAMIC_0_tag *) 0x40081100)

struct EMC_DYNAMIC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t MD:2;
      uint64_t reservedSpace1:2;
      uint64_t AM0:6;
      uint64_t reservedSpace2:1;
      uint64_t AM1:1;
      uint64_t reservedSpace3:4;
      uint64_t B:1;
      uint64_t P:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICCONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAS:2;
      uint64_t reservedSpace0:6;
      uint64_t CAS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICRASCAS;

