iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
};

#define EMC_DYNAMIC_1 (*(volatile struct EMC_DYNAMIC_1_tag *) 0x40081120)

struct EMC_DYNAMIC_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t MD:2;
      uint64_t reservedSpace1:2;
      uint64_t AM0:6;
      uint64_t reservedSpace2:1;
      uint64_t AM1:1;
      uint64_t reservedSpace3:4;
      uint64_t B:1;
      uint64_t P:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICCONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAS:2;
      uint64_t reservedSpace0:6;
      uint64_t CAS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICRASCAS;

};

#define EMC_DYNAMIC_2 (*(volatile struct EMC_DYNAMIC_2_tag *) 0x40081140)

struct EMC_DYNAMIC_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t MD:2;
      uint64_t reservedSpace1:2;
      uint64_t AM0:6;
      uint64_t reservedSpace2:1;
      uint64_t AM1:1;
      uint64_t reservedSpace3:4;
      uint64_t B:1;
      uint64_t P:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICCONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAS:2;
      uint64_t reservedSpace0:6;
      uint64_t CAS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYNAMICRASCAS;

};

#define EMC_DYNAMIC_3 (*(volatile struct EMC_DYNAMIC_3_tag *) 0x40081160)

struct EMC_STATIC_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MW:2;
      uint64_t reservedSpace0:1;
      uint64_t PM:1;
      uint64_t reservedSpace1:2;
      uint64_t PC:1;
      uint64_t PB:1;
      uint64_t EW:1;
      uint64_t reservedSpace2:10;
      uint64_t B:1;
      uint64_t P:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICCONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITWEN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITWEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITOEN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITOEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITRD:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITRD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITPAGE:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITPAGE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITWR:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITWR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITTURN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITTURN;

};

#define EMC_STATIC_0 (*(volatile struct EMC_STATIC_0_tag *) 0x40081200)

struct EMC_STATIC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MW:2;
      uint64_t reservedSpace0:1;
      uint64_t PM:1;
      uint64_t reservedSpace1:2;
      uint64_t PC:1;
      uint64_t PB:1;
      uint64_t EW:1;
      uint64_t reservedSpace2:10;
      uint64_t B:1;
      uint64_t P:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICCONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITWEN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITWEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITOEN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITOEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITRD:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITRD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITPAGE:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITPAGE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITWR:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITWR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITTURN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITTURN;

};

#define EMC_STATIC_1 (*(volatile struct EMC_STATIC_1_tag *) 0x40081220)

struct EMC_STATIC_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MW:2;
      uint64_t reservedSpace0:1;
      uint64_t PM:1;
      uint64_t reservedSpace1:2;
      uint64_t PC:1;
      uint64_t PB:1;
      uint64_t EW:1;
      uint64_t reservedSpace2:10;
      uint64_t B:1;
      uint64_t P:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICCONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITWEN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITWEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITOEN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITOEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITRD:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITRD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITPAGE:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITPAGE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITWR:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITWR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITTURN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITTURN;

};

#define EMC_STATIC_2 (*(volatile struct EMC_STATIC_2_tag *) 0x40081240)

struct EMC_STATIC_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MW:2;
      uint64_t reservedSpace0:1;
      uint64_t PM:1;
      uint64_t reservedSpace1:2;
      uint64_t PC:1;
      uint64_t PB:1;
      uint64_t EW:1;
      uint64_t reservedSpace2:10;
      uint64_t B:1;
      uint64_t P:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICCONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITWEN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITWEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITOEN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITOEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITRD:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITRD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITPAGE:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITPAGE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITWR:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITWR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITTURN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATICWAITTURN;

