iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
};

#define DMA0_CHANNEL_27 (*(volatile struct DMA0_CHANNEL_27_tag *) 0x400825b0)

struct DMA0_CHANNEL_28_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHREQEN:1;
      uint64_t HWTRIGEN:1;
      uint64_t reservedSpace0:2;
      uint64_t TRIGPOL:1;
      uint64_t TRIGTYPE:1;
      uint64_t TRIGBURST:1;
      uint64_t reservedSpace1:1;
      uint64_t BURSTPOWER:4;
      uint64_t reservedSpace2:2;
      uint64_t SRCBURSTWRAP:1;
      uint64_t DSTBURSTWRAP:1;
      uint64_t CHPRIORITY:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALIDPENDING:1;
      uint64_t reservedSpace0:1;
      uint64_t TRIG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTLSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFGVALID:1;
      uint64_t RELOAD:1;
      uint64_t SWTRIG:1;
      uint64_t CLRTRIG:1;
      uint64_t SETINTA:1;
      uint64_t SETINTB:1;
      uint64_t reservedSpace0:2;
      uint64_t WIDTH:2;
      uint64_t reservedSpace1:2;
      uint64_t SRCINC:2;
      uint64_t DSTINC:2;
      uint64_t XFERCOUNT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XFERCFG;

};

#define DMA0_CHANNEL_28 (*(volatile struct DMA0_CHANNEL_28_tag *) 0x400825c0)

struct DMA0_CHANNEL_29_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHREQEN:1;
      uint64_t HWTRIGEN:1;
      uint64_t reservedSpace0:2;
      uint64_t TRIGPOL:1;
      uint64_t TRIGTYPE:1;
      uint64_t TRIGBURST:1;
      uint64_t reservedSpace1:1;
      uint64_t BURSTPOWER:4;
      uint64_t reservedSpace2:2;
      uint64_t SRCBURSTWRAP:1;
      uint64_t DSTBURSTWRAP:1;
      uint64_t CHPRIORITY:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALIDPENDING:1;
      uint64_t reservedSpace0:1;
      uint64_t TRIG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTLSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFGVALID:1;
      uint64_t RELOAD:1;
      uint64_t SWTRIG:1;
      uint64_t CLRTRIG:1;
      uint64_t SETINTA:1;
      uint64_t SETINTB:1;
      uint64_t reservedSpace0:2;
      uint64_t WIDTH:2;
      uint64_t reservedSpace1:2;
      uint64_t SRCINC:2;
      uint64_t DSTINC:2;
      uint64_t XFERCOUNT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XFERCFG;

};

#define DMA0_CHANNEL_29 (*(volatile struct DMA0_CHANNEL_29_tag *) 0x400825d0)

struct LCD_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PPL:6;
      uint64_t HSW:8;
      uint64_t HFP:8;
      uint64_t HBP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPP:10;
      uint64_t VSW:6;
      uint64_t VFP:8;
      uint64_t VBP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCD_LO:5;
      uint64_t reservedSpace0:1;
      uint64_t ACB:5;
      uint64_t IVS:1;
      uint64_t IHS:1;
      uint64_t IPC:1;
      uint64_t IOE:1;
      uint64_t reservedSpace1:1;
      uint64_t CPL:10;
      uint64_t BCD:1;
      uint64_t PCD_HI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) POL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LED:7;
      uint64_t reservedSpace0:9;
      uint64_t LEE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t LCDUPBASE:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UPBASE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t LCDLPBASE:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPBASE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDEN:1;
      uint64_t LCDBPP:3;
      uint64_t LCDBW:1;
      uint64_t LCDTFT:1;
      uint64_t LCDMONO8:1;
      uint64_t LCDDUAL:1;
      uint64_t BGR:1;
      uint64_t BEBO:1;
      uint64_t BEPO:1;
      uint64_t LCDPWR:1;
      uint64_t LCDVCOMP:2;
      uint64_t reservedSpace0:2;
      uint64_t WATERMARK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t FUFIM:1;
      uint64_t LNBUIM:1;
      uint64_t VCOMPIM:1;
      uint64_t BERIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t FUFRIS:1;
      uint64_t LNBURIS:1;
      uint64_t VCOMPRIS:1;
      uint64_t BERRAW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTRAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t FUFMIS:1;
      uint64_t LNBUMIS:1;
      uint64_t VCOMPMIS:1;
      uint64_t BERMIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t FUFIC:1;
      uint64_t LNBUIC:1;
      uint64_t VCOMPIC:1;
      uint64_t BERIC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDUPCURR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UPCURR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDLPCURR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPCURR;

  uint8_t res0[460];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_46;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_50;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_52;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_53;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_54;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_57;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_58;

