iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_59;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_60;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_61;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_62;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_63;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_65;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_66;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_67;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_68;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_69;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_70;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_71;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_72;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_73;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_74;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_75;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_76;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_77;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_78;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_79;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_80;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_81;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_82;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_83;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_84;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_85;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_86;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_87;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_88;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_89;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_90;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_91;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_92;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_93;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_94;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_95;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_96;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_97;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_98;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_99;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_100;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_101;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_102;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_103;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_104;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_105;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_106;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_107;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_108;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_109;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_110;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_111;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_112;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_113;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_114;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_115;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_116;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_117;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_118;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_119;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_120;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_121;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_122;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_123;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_124;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_125;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_126;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R04_0:5;
      uint64_t G04_0:5;
      uint64_t B04_0:5;
      uint64_t I0:1;
      uint64_t R14_0:5;
      uint64_t G14_0:5;
      uint64_t B14_0:5;
      uint64_t I1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAL_127;

  uint8_t res1[1024];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_18;

