iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_176;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_177;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_178;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_179;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_180;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_181;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_182;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_183;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_184;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_185;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_186;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_187;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_188;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_189;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_190;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_191;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_192;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_193;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_194;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_195;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_196;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_197;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_198;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_199;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_200;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_201;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_202;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_203;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_204;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_205;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_206;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_207;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_208;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_209;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_210;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_211;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_212;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_213;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_214;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_215;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_216;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_217;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_218;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_219;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_220;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_221;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_222;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_223;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_224;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_225;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_226;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_227;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_228;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_229;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_230;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_231;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_232;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_233;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_234;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_235;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_236;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_237;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_238;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_239;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_240;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_241;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_242;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_243;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_244;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_245;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_246;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_247;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_248;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_249;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_250;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_251;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_252;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_253;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_254;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSR_IMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_IMG_255;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSRON:1;
      uint64_t reservedSpace0:3;
      uint64_t CRSRNUM1_0:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSRSIZE:1;
      uint64_t FRAMESYNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RED:8;
      uint64_t GREEN:8;
      uint64_t BLUE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_PAL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RED:8;
      uint64_t GREEN:8;
      uint64_t BLUE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_PAL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSRX:10;
      uint64_t reservedSpace0:6;
      uint64_t CRSRY:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_XY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSRCLIPX:6;
      uint64_t reservedSpace0:2;
      uint64_t CRSRCLIPY:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_CLIP;

