iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSRIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_INTMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSRIC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_INTCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSRRIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_INTRAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRSRMIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSR_INTSTAT;

};

#define LCD (*(volatile struct LCD_tag *) 0x40083000)

struct USB0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEV_ADDR:7;
      uint64_t DEV_EN:1;
      uint64_t SETUP:1;
      uint64_t FORCE_NEEDCLK:1;
      uint64_t reservedSpace0:1;
      uint64_t LPM_SUP:1;
      uint64_t INTONNAK_AO:1;
      uint64_t INTONNAK_AI:1;
      uint64_t INTONNAK_CO:1;
      uint64_t INTONNAK_CI:1;
      uint64_t DCON:1;
      uint64_t DSUS:1;
      uint64_t reservedSpace1:1;
      uint64_t LPM_SUS:1;
      uint64_t LPM_REWP:1;
      uint64_t reservedSpace2:3;
      uint64_t DCON_C:1;
      uint64_t DSUS_C:1;
      uint64_t DRES_C:1;
      uint64_t reservedSpace3:1;
      uint64_t VBUSDEBOUNCED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEVCMDSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRAME_NR:11;
      uint64_t ERR_CODE:4;
      uint64_t reservedSpace0:1;
      uint64_t MINREV:8;
      uint64_t MAJREV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INFO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t EP_LIST:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPLISTSTART;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:22;
      uint64_t DA_BUF:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATABUFSTART;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIRD_HW:4;
      uint64_t HIRD_SW:4;
      uint64_t DATA_PENDING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SKIP:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPSKIP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t BUF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPINUSE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t BUF_SB:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPBUFCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EP0OUT:1;
      uint64_t EP0IN:1;
      uint64_t EP1OUT:1;
      uint64_t EP1IN:1;
      uint64_t EP2OUT:1;
      uint64_t EP2IN:1;
      uint64_t EP3OUT:1;
      uint64_t EP3IN:1;
      uint64_t EP4OUT:1;
      uint64_t EP4IN:1;
      uint64_t reservedSpace0:20;
      uint64_t FRAME_INT:1;
      uint64_t DEV_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EP_INT_EN:10;
      uint64_t reservedSpace0:20;
      uint64_t FRAME_INT_EN:1;
      uint64_t DEV_INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EP_SET_INT:10;
      uint64_t reservedSpace0:20;
      uint64_t FRAME_SET_INT:1;
      uint64_t DEV_SET_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSETSTAT;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOGGLE:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPTOGGLE;

};

#define USB0 (*(volatile struct USB0_tag *) 0x40084000)

struct SCT0_EVENT_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATEMSKn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCHSEL:4;
      uint64_t HEVENT:1;
      uint64_t OUTSEL:1;
      uint64_t IOSEL:4;
      uint64_t IOCOND:2;
      uint64_t COMBMODE:2;
      uint64_t STATELD:1;
      uint64_t STATEV:5;
      uint64_t MATCHMEM:1;
      uint64_t DIRECTION:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

};

#define SCT0_EVENT_0 (*(volatile struct SCT0_EVENT_0_tag *) 0x40085300)

struct SCT0_EVENT_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATEMSKn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCHSEL:4;
      uint64_t HEVENT:1;
      uint64_t OUTSEL:1;
      uint64_t IOSEL:4;
      uint64_t IOCOND:2;
      uint64_t COMBMODE:2;
      uint64_t STATELD:1;
      uint64_t STATEV:5;
      uint64_t MATCHMEM:1;
      uint64_t DIRECTION:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

};

#define SCT0_EVENT_1 (*(volatile struct SCT0_EVENT_1_tag *) 0x40085308)

struct SCT0_EVENT_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATEMSKn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCHSEL:4;
      uint64_t HEVENT:1;
      uint64_t OUTSEL:1;
      uint64_t IOSEL:4;
      uint64_t IOCOND:2;
      uint64_t COMBMODE:2;
      uint64_t STATELD:1;
      uint64_t STATEV:5;
      uint64_t MATCHMEM:1;
      uint64_t DIRECTION:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

};

#define SCT0_EVENT_2 (*(volatile struct SCT0_EVENT_2_tag *) 0x40085310)

struct SCT0_EVENT_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATEMSKn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCHSEL:4;
      uint64_t HEVENT:1;
      uint64_t OUTSEL:1;
      uint64_t IOSEL:4;
      uint64_t IOCOND:2;
      uint64_t COMBMODE:2;
      uint64_t STATELD:1;
      uint64_t STATEV:5;
      uint64_t MATCHMEM:1;
      uint64_t DIRECTION:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

