iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
};

#define SCT0_EVENT_3 (*(volatile struct SCT0_EVENT_3_tag *) 0x40085318)

struct SCT0_EVENT_4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATEMSKn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCHSEL:4;
      uint64_t HEVENT:1;
      uint64_t OUTSEL:1;
      uint64_t IOSEL:4;
      uint64_t IOCOND:2;
      uint64_t COMBMODE:2;
      uint64_t STATELD:1;
      uint64_t STATEV:5;
      uint64_t MATCHMEM:1;
      uint64_t DIRECTION:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

};

#define SCT0_EVENT_4 (*(volatile struct SCT0_EVENT_4_tag *) 0x40085320)

struct SCT0_EVENT_5_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATEMSKn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCHSEL:4;
      uint64_t HEVENT:1;
      uint64_t OUTSEL:1;
      uint64_t IOSEL:4;
      uint64_t IOCOND:2;
      uint64_t COMBMODE:2;
      uint64_t STATELD:1;
      uint64_t STATEV:5;
      uint64_t MATCHMEM:1;
      uint64_t DIRECTION:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

};

#define SCT0_EVENT_5 (*(volatile struct SCT0_EVENT_5_tag *) 0x40085328)

struct SCT0_EVENT_6_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATEMSKn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCHSEL:4;
      uint64_t HEVENT:1;
      uint64_t OUTSEL:1;
      uint64_t IOSEL:4;
      uint64_t IOCOND:2;
      uint64_t COMBMODE:2;
      uint64_t STATELD:1;
      uint64_t STATEV:5;
      uint64_t MATCHMEM:1;
      uint64_t DIRECTION:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

};

#define SCT0_EVENT_6 (*(volatile struct SCT0_EVENT_6_tag *) 0x40085330)

struct SCT0_EVENT_7_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATEMSKn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCHSEL:4;
      uint64_t HEVENT:1;
      uint64_t OUTSEL:1;
      uint64_t IOSEL:4;
      uint64_t IOCOND:2;
      uint64_t COMBMODE:2;
      uint64_t STATELD:1;
      uint64_t STATEV:5;
      uint64_t MATCHMEM:1;
      uint64_t DIRECTION:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

};

#define SCT0_EVENT_7 (*(volatile struct SCT0_EVENT_7_tag *) 0x40085338)

struct SCT0_EVENT_8_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATEMSKn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCHSEL:4;
      uint64_t HEVENT:1;
      uint64_t OUTSEL:1;
      uint64_t IOSEL:4;
      uint64_t IOCOND:2;
      uint64_t COMBMODE:2;
      uint64_t STATELD:1;
      uint64_t STATEV:5;
      uint64_t MATCHMEM:1;
      uint64_t DIRECTION:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

};

#define SCT0_EVENT_8 (*(volatile struct SCT0_EVENT_8_tag *) 0x40085340)

struct SCT0_EVENT_9_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATEMSKn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCHSEL:4;
      uint64_t HEVENT:1;
      uint64_t OUTSEL:1;
      uint64_t IOSEL:4;
      uint64_t IOCOND:2;
      uint64_t COMBMODE:2;
      uint64_t STATELD:1;
      uint64_t STATEV:5;
      uint64_t MATCHMEM:1;
      uint64_t DIRECTION:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

};

#define SCT0_EVENT_9 (*(volatile struct SCT0_EVENT_9_tag *) 0x40085348)

struct SCT0_OUT_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR;

};

#define SCT0_OUT_0 (*(volatile struct SCT0_OUT_0_tag *) 0x40085500)

struct SCT0_OUT_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR;

};

#define SCT0_OUT_1 (*(volatile struct SCT0_OUT_1_tag *) 0x40085508)

struct SCT0_OUT_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR;

};

#define SCT0_OUT_2 (*(volatile struct SCT0_OUT_2_tag *) 0x40085510)

struct SCT0_OUT_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR;

};

#define SCT0_OUT_3 (*(volatile struct SCT0_OUT_3_tag *) 0x40085518)

struct SCT0_OUT_4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR;

};

#define SCT0_OUT_4 (*(volatile struct SCT0_OUT_4_tag *) 0x40085520)

struct SCT0_OUT_5_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR;

