iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
};

#define SCT0_OUT_5 (*(volatile struct SCT0_OUT_5_tag *) 0x40085528)

struct SCT0_OUT_6_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR;

};

#define SCT0_OUT_6 (*(volatile struct SCT0_OUT_6_tag *) 0x40085530)

struct SCT0_OUT_7_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR;

};

#define SCT0_OUT_7 (*(volatile struct SCT0_OUT_7_tag *) 0x40085538)

struct SCT0_OUT_8_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR;

};

#define SCT0_OUT_8 (*(volatile struct SCT0_OUT_8_tag *) 0x40085540)

struct SCT0_OUT_9_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR;

};

#define SCT0_OUT_9 (*(volatile struct SCT0_OUT_9_tag *) 0x40085548)

struct FLEXCOMM0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERSEL:3;
      uint64_t LOCK:1;
      uint64_t USARTPRESENT:1;
      uint64_t SPIPRESENT:1;
      uint64_t I2CPRESENT:1;
      uint64_t I2SPRESENT:1;
      uint64_t reservedSpace0:4;
      uint64_t ID:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSELID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Aperture:8;
      uint64_t Minor_Rev:4;
      uint64_t Major_Rev:4;
      uint64_t ID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

};

#define FLEXCOMM0 (*(volatile struct FLEXCOMM0_tag *) 0x40086ff8)

struct FLEXCOMM1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERSEL:3;
      uint64_t LOCK:1;
      uint64_t USARTPRESENT:1;
      uint64_t SPIPRESENT:1;
      uint64_t I2CPRESENT:1;
      uint64_t I2SPRESENT:1;
      uint64_t reservedSpace0:4;
      uint64_t ID:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSELID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Aperture:8;
      uint64_t Minor_Rev:4;
      uint64_t Major_Rev:4;
      uint64_t ID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

};

#define FLEXCOMM1 (*(volatile struct FLEXCOMM1_tag *) 0x40087ff8)

struct FLEXCOMM2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERSEL:3;
      uint64_t LOCK:1;
      uint64_t USARTPRESENT:1;
      uint64_t SPIPRESENT:1;
      uint64_t I2CPRESENT:1;
      uint64_t I2SPRESENT:1;
      uint64_t reservedSpace0:4;
      uint64_t ID:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSELID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Aperture:8;
      uint64_t Minor_Rev:4;
      uint64_t Major_Rev:4;
      uint64_t ID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

};

#define FLEXCOMM2 (*(volatile struct FLEXCOMM2_tag *) 0x40088ff8)

struct FLEXCOMM3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERSEL:3;
      uint64_t LOCK:1;
      uint64_t USARTPRESENT:1;
      uint64_t SPIPRESENT:1;
      uint64_t I2CPRESENT:1;
      uint64_t I2SPRESENT:1;
      uint64_t reservedSpace0:4;
      uint64_t ID:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSELID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Aperture:8;
      uint64_t Minor_Rev:4;
      uint64_t Major_Rev:4;
      uint64_t ID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

};

#define FLEXCOMM3 (*(volatile struct FLEXCOMM3_tag *) 0x40089ff8)

struct FLEXCOMM4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERSEL:3;
      uint64_t LOCK:1;
      uint64_t USARTPRESENT:1;
      uint64_t SPIPRESENT:1;
      uint64_t I2CPRESENT:1;
      uint64_t I2SPRESENT:1;
      uint64_t reservedSpace0:4;
      uint64_t ID:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSELID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Aperture:8;
      uint64_t Minor_Rev:4;
      uint64_t Major_Rev:4;
      uint64_t ID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

};

#define FLEXCOMM4 (*(volatile struct FLEXCOMM4_tag *) 0x4008aff8)

struct FLEXCOMM5_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERSEL:3;
      uint64_t LOCK:1;
      uint64_t USARTPRESENT:1;
      uint64_t SPIPRESENT:1;
      uint64_t I2CPRESENT:1;
      uint64_t I2SPRESENT:1;
      uint64_t reservedSpace0:4;
      uint64_t ID:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSELID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Aperture:8;
      uint64_t Minor_Rev:4;
      uint64_t Major_Rev:4;
      uint64_t ID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

};

#define FLEXCOMM5 (*(volatile struct FLEXCOMM5_tag *) 0x40096ff8)

struct FLEXCOMM6_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERSEL:3;
      uint64_t LOCK:1;
      uint64_t USARTPRESENT:1;
      uint64_t SPIPRESENT:1;
      uint64_t I2CPRESENT:1;
      uint64_t I2SPRESENT:1;
      uint64_t reservedSpace0:4;
      uint64_t ID:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSELID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Aperture:8;
      uint64_t Minor_Rev:4;
      uint64_t Major_Rev:4;
      uint64_t ID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

