iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
};

#define FLEXCOMM6 (*(volatile struct FLEXCOMM6_tag *) 0x40097ff8)

struct FLEXCOMM7_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERSEL:3;
      uint64_t LOCK:1;
      uint64_t USARTPRESENT:1;
      uint64_t SPIPRESENT:1;
      uint64_t I2CPRESENT:1;
      uint64_t I2SPRESENT:1;
      uint64_t reservedSpace0:4;
      uint64_t ID:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSELID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Aperture:8;
      uint64_t Minor_Rev:4;
      uint64_t Major_Rev:4;
      uint64_t ID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

};

#define FLEXCOMM7 (*(volatile struct FLEXCOMM7_tag *) 0x40098ff8)

struct FLEXCOMM8_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERSEL:3;
      uint64_t LOCK:1;
      uint64_t USARTPRESENT:1;
      uint64_t SPIPRESENT:1;
      uint64_t I2CPRESENT:1;
      uint64_t I2SPRESENT:1;
      uint64_t reservedSpace0:4;
      uint64_t ID:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSELID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Aperture:8;
      uint64_t Minor_Rev:4;
      uint64_t Major_Rev:4;
      uint64_t ID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

};

#define FLEXCOMM8 (*(volatile struct FLEXCOMM8_tag *) 0x40099ff8)

struct FLEXCOMM9_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERSEL:3;
      uint64_t LOCK:1;
      uint64_t USARTPRESENT:1;
      uint64_t SPIPRESENT:1;
      uint64_t I2CPRESENT:1;
      uint64_t I2SPRESENT:1;
      uint64_t reservedSpace0:4;
      uint64_t ID:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSELID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Aperture:8;
      uint64_t Minor_Rev:4;
      uint64_t Major_Rev:4;
      uint64_t ID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

};

#define FLEXCOMM9 (*(volatile struct FLEXCOMM9_tag *) 0x4009aff8)

struct SPI0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t reservedSpace0:1;
      uint64_t MASTER:1;
      uint64_t LSBF:1;
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t reservedSpace1:1;
      uint64_t LOOP:1;
      uint64_t SPOL0:1;
      uint64_t SPOL1:1;
      uint64_t SPOL2:1;
      uint64_t SPOL3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRE_DELAY:4;
      uint64_t POST_DELAY:4;
      uint64_t FRAME_DELAY:4;
      uint64_t TRANSFER_DELAY:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t SSA:1;
      uint64_t SSD:1;
      uint64_t STALLED:1;
      uint64_t ENDTRANSFER:1;
      uint64_t MSTIDLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t SSAEN:1;
      uint64_t SSDEN:1;
      uint64_t reservedSpace1:2;
      uint64_t MSTIDLEEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t SSAEN:1;
      uint64_t SSDEN:1;
      uint64_t reservedSpace1:2;
      uint64_t MSTIDLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENCLR;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVVAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t SSA:1;
      uint64_t SSD:1;
      uint64_t reservedSpace1:2;
      uint64_t MSTIDLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  uint8_t res1[2516];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLETX:1;
      uint64_t ENABLERX:1;
      uint64_t reservedSpace0:2;
      uint64_t SIZE:2;
      uint64_t reservedSpace1:6;
      uint64_t DMATX:1;
      uint64_t DMARX:1;
      uint64_t WAKETX:1;
      uint64_t WAKERX:1;
      uint64_t EMPTYTX:1;
      uint64_t EMPTYRX:1;
      uint64_t POPDBG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t reservedSpace0:1;
      uint64_t PERINT:1;
      uint64_t TXEMPTY:1;
      uint64_t TXNOTFULL:1;
      uint64_t RXNOTEMPTY:1;
      uint64_t RXFULL:1;
      uint64_t TXLVL:5;
      uint64_t reservedSpace1:3;
      uint64_t RXLVL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXLVLENA:1;
      uint64_t RXLVLENA:1;
      uint64_t reservedSpace0:6;
      uint64_t TXLVL:4;
      uint64_t reservedSpace1:4;
      uint64_t RXLVL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOTRIG;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t TXLVL:1;
      uint64_t RXLVL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOINTENSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t TXLVL:1;
      uint64_t RXLVL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOINTENCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t TXLVL:1;
      uint64_t RXLVL:1;
      uint64_t PERINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOINTSTAT;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t TXSSEL0_N:1;
      uint64_t TXSSEL1_N:1;
      uint64_t TXSSEL2_N:1;
      uint64_t TXSSEL3_N:1;
      uint64_t EOT:1;
      uint64_t EOF:1;
      uint64_t RXIGNORE:1;
      uint64_t reservedSpace0:1;
      uint64_t LEN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOWR;

  uint8_t res4[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:16;
      uint64_t RXSSEL0_N:1;
      uint64_t RXSSEL1_N:1;
      uint64_t RXSSEL2_N:1;
      uint64_t RXSSEL3_N:1;
      uint64_t SOT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFORD;

