iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t TXLVL:1;
      uint64_t RXLVL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOINTENSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t TXLVL:1;
      uint64_t RXLVL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOINTENCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t TXLVL:1;
      uint64_t RXLVL:1;
      uint64_t PERINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOINTSTAT;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOWR;

  uint8_t res4[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:9;
      uint64_t reservedSpace0:4;
      uint64_t FRAMERR:1;
      uint64_t PARITYERR:1;
      uint64_t RXNOISE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFORD;

  uint8_t res5[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:9;
      uint64_t reservedSpace0:4;
      uint64_t FRAMERR:1;
      uint64_t PARITYERR:1;
      uint64_t RXNOISE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFORDNOPOP;

};

#define USART4 (*(volatile struct USART4_tag *) 0x4008a000)

struct GPIO_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR_5;

  uint8_t res0[104];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK_5;

  uint8_t res1[104];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN_5;

  uint8_t res2[104];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN_5;

  uint8_t res3[104];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET_5;

  uint8_t res4[104];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_5;

  uint8_t res5[104];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT_5;

  uint8_t res6[104];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRSETP:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRSET_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRSETP:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRSET_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRSETP:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRSET_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRSETP:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRSET_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRSETP:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRSET_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRSETP:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRSET_5;

  uint8_t res7[104];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRCLRP:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRCLR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRCLRP:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRCLR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRCLRP:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRCLR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRCLRP:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRCLR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRCLRP:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRCLR_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRCLRP:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRCLR_5;

  uint8_t res8[104];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRNOTP:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRNOT_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRNOTP:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRNOT_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRNOTP:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRNOT_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRNOTP:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRNOT_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRNOTP:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRNOT_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRNOTP:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRNOT_5;

