iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
};

#define GPIO_PB_5 (*(volatile struct GPIO_PB_5_tag *) 0x4008c0a0)

struct GPIO_PW_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_31;

};

#define GPIO_PW_0 (*(volatile struct GPIO_PW_0_tag *) 0x4008d000)

struct GPIO_PW_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W_31;

