iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
};

#define GPIO_PW_5 (*(volatile struct GPIO_PW_5_tag *) 0x4008d280)

struct DMIC0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN_CH0:1;
      uint64_t EN_CH1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHANEN;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_BYPASS0:1;
      uint64_t CLK_BYPASS1:1;
      uint64_t STEREO_DATA0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USE2FS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USE2FS;

  uint8_t res1[108];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INPUTGAIN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWVADGAIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HPFS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWVADHPFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ST10:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWVADST10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSTT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWVADRSTT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THGN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWVADTHGN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THGS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWVADTHGS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOWZ:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWVADLOWZ;

  uint8_t res2[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

};

#define DMIC0 (*(volatile struct DMIC0_tag *) 0x40090f00)

struct DMIC0_CHANNEL_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDMDIV:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIVHFCLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PREAC2FSCOEF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PREAC4FSCOEF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GAIN:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAINSHIFT;

  uint8_t res0[108];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t RESET:1;
      uint64_t INTEN:1;
      uint64_t DMAEN:1;
      uint64_t reservedSpace0:12;
      uint64_t TRIGLVL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT:1;
      uint64_t OVERRUN:1;
      uint64_t UNDERRUN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFODATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PHY_FALL:1;
      uint64_t PHY_HALF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDMSRCCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCPOLE:2;
      uint64_t reservedSpace0:2;
      uint64_t DCGAIN:4;
      uint64_t SATURATEAT16BIT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCTRL;

};

#define DMIC0_CHANNEL_0 (*(volatile struct DMIC0_CHANNEL_0_tag *) 0x40090000)

struct DMIC0_CHANNEL_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDMDIV:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIVHFCLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PREAC2FSCOEF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PREAC4FSCOEF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GAIN:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAINSHIFT;

  uint8_t res0[108];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t RESET:1;
      uint64_t INTEN:1;
      uint64_t DMAEN:1;
      uint64_t reservedSpace0:12;
      uint64_t TRIGLVL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT:1;
      uint64_t OVERRUN:1;
      uint64_t UNDERRUN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFODATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PHY_FALL:1;
      uint64_t PHY_HALF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDMSRCCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCPOLE:2;
      uint64_t reservedSpace0:2;
      uint64_t DCGAIN:4;
      uint64_t SATURATEAT16BIT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCTRL;

};

#define DMIC0_CHANNEL_1 (*(volatile struct DMIC0_CHANNEL_1_tag *) 0x40090100)

struct ENET_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RE:1;
      uint64_t TE:1;
      uint64_t PRELEN:2;
      uint64_t DC:1;
      uint64_t BL:2;
      uint64_t reservedSpace0:1;
      uint64_t DR:1;
      uint64_t DCRS:1;
      uint64_t DO:1;
      uint64_t ECRSFD:1;
      uint64_t LM:1;
      uint64_t DM:1;
      uint64_t FES:1;
      uint64_t PS:1;
      uint64_t JE:1;
      uint64_t JD:1;
      uint64_t BE:1;
      uint64_t WD:1;
      uint64_t ACS:1;
      uint64_t CST:1;
      uint64_t S2KP:1;
      uint64_t GPSLCE:1;
      uint64_t IPG:3;
      uint64_t IPC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPSL:14;
      uint64_t reservedSpace0:2;
      uint64_t DCRCC:1;
      uint64_t SPEN:1;
      uint64_t USP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_EXT_CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PR:1;
      uint64_t reservedSpace0:2;
      uint64_t DAIF:1;
      uint64_t PM:1;
      uint64_t DBF:1;
      uint64_t PCF:2;
      uint64_t SAIF:1;
      uint64_t SAF:1;
      uint64_t reservedSpace1:21;
      uint64_t RA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_FRAME_FILTER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WTO:4;
      uint64_t reservedSpace0:4;
      uint64_t PWE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_WD_TIMEROUT;

