iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
  uint8_t res0[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCB:1;
      uint64_t TFE:1;
      uint64_t reservedSpace0:2;
      uint64_t PLT:3;
      uint64_t DZPQ:1;
      uint64_t reservedSpace1:8;
      uint64_t PT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_TX_FLOW_CTRL_Q_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCB:1;
      uint64_t TFE:1;
      uint64_t reservedSpace0:2;
      uint64_t PLT:3;
      uint64_t DZPQ:1;
      uint64_t reservedSpace1:8;
      uint64_t PT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_TX_FLOW_CTRL_Q_1;

  uint8_t res1[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFE:1;
      uint64_t UP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_RX_FLOW_CTRL;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSTQ0:8;
      uint64_t PSTQ1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_TXQ_PRIO_MAP;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXQ0EN:2;
      uint64_t RXQ1EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_RXQ_CTRL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AVCPQ:3;
      uint64_t reservedSpace0:1;
      uint64_t AVPTPQ:3;
      uint64_t reservedSpace1:5;
      uint64_t UPQ:3;
      uint64_t reservedSpace2:1;
      uint64_t MCBCQ:3;
      uint64_t reservedSpace3:1;
      uint64_t MCBCQEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_RXQ_CTRL1;

  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t PHYIS:1;
      uint64_t PMTIS:1;
      uint64_t LPIIS:1;
      uint64_t reservedSpace1:6;
      uint64_t TSIS:1;
      uint64_t TXSTSIS:1;
      uint64_t RXSTSIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_INTR_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t PHYIE:1;
      uint64_t PMTIE:1;
      uint64_t LPIIE:1;
      uint64_t reservedSpace1:6;
      uint64_t TSIE:1;
      uint64_t TXSTSIE:1;
      uint64_t RXSTSIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_INTR_EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TJT:1;
      uint64_t NCARR:1;
      uint64_t LCARR:1;
      uint64_t EXDEF:1;
      uint64_t LCOL:1;
      uint64_t EXCOL:1;
      uint64_t reservedSpace0:2;
      uint64_t RWT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_RXTX_STAT;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWRDWN:1;
      uint64_t MGKPKTEN:1;
      uint64_t RWKPKTEN:1;
      uint64_t reservedSpace0:2;
      uint64_t MGKPRCVD:1;
      uint64_t RWKPRCVD:1;
      uint64_t reservedSpace1:2;
      uint64_t GLBLUCAST:1;
      uint64_t RWKPFE:1;
      uint64_t reservedSpace2:13;
      uint64_t RWKPTR:5;
      uint64_t reservedSpace3:2;
      uint64_t RWKFILTRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_PMT_CRTL_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_RWAKE_FRFLT;

  uint8_t res6[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLPIEN:1;
      uint64_t TLPIEX:1;
      uint64_t RLPIEN:1;
      uint64_t RLPIEX:1;
      uint64_t reservedSpace0:4;
      uint64_t TLPIST:1;
      uint64_t RLPIST:1;
      uint64_t reservedSpace1:6;
      uint64_t LPIEN:1;
      uint64_t PLS:1;
      uint64_t reservedSpace2:1;
      uint64_t LPITXA:1;
      uint64_t LPIATE:1;
      uint64_t LPITCSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_LPI_CTRL_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TWT:16;
      uint64_t LST:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_LPI_TIMER_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t LPIET:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_LPI_ENTR_TIMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIC_1US_CNTR:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_1US_TIC_COUNTR;

  uint8_t res7[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SNPVER:8;
      uint64_t USERVER:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_VERSION;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REPESTS:1;
      uint64_t RFCFCSTS:2;
      uint64_t reservedSpace0:13;
      uint64_t TPESTS:1;
      uint64_t TFCSTS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_DBG;

  uint8_t res8[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIISEL:1;
      uint64_t reservedSpace0:1;
      uint64_t HDSEL:1;
      uint64_t reservedSpace1:1;
      uint64_t VLHASH:1;
      uint64_t SMASEL:1;
      uint64_t RWKSEL:1;
      uint64_t MGKSEL:1;
      uint64_t MMCSEL:1;
      uint64_t ARPOFFSEL:1;
      uint64_t reservedSpace2:2;
      uint64_t TSSEL:1;
      uint64_t EEESEL:1;
      uint64_t TXCOESEL:1;
      uint64_t reservedSpace3:1;
      uint64_t RXCOESEL:1;
      uint64_t reservedSpace4:8;
      uint64_t TSSTSSEL:2;
      uint64_t reservedSpace5:1;
      uint64_t ACTPHYSEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_HW_FEAT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXFIFOSIZE:5;
      uint64_t reservedSpace0:1;
      uint64_t TXFIFOSIZE:5;
      uint64_t OSTEN:1;
      uint64_t PTOEN:1;
      uint64_t ADVTHWORD:1;
      uint64_t ADDR64:2;
      uint64_t DCBEN:1;
      uint64_t SPEN:1;
      uint64_t TSOEN:1;
      uint64_t DBGMEMA:1;
      uint64_t AVSEL:1;
      uint64_t reservedSpace1:2;
      uint64_t LPMODEEN:1;
      uint64_t HASHTBLSZ:2;
      uint64_t reservedSpace2:1;
      uint64_t L3_L4_FILTER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_HW_FEAT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXQCNT:4;
      uint64_t reservedSpace0:2;
      uint64_t TXQCNT:4;
      uint64_t reservedSpace1:2;
      uint64_t RXCHCNT:4;
      uint64_t reservedSpace2:2;
      uint64_t TXCHCNT:4;
      uint64_t reservedSpace3:2;
      uint64_t PPSOUTNUM:3;
      uint64_t reservedSpace4:1;
      uint64_t AUXSNAPNUM:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_HW_FEAT2;

  uint8_t res9[216];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MB:1;
      uint64_t reservedSpace0:1;
      uint64_t MOC:2;
      uint64_t reservedSpace1:4;
      uint64_t CR:4;
      uint64_t NTC:3;
      uint64_t reservedSpace2:1;
      uint64_t RDA:5;
      uint64_t PA:5;
      uint64_t BTB:1;
      uint64_t PSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_MDIO_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_MDIO_DATA;

  uint8_t res10[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A47_32:16;
      uint64_t DCS:1;
      uint64_t reservedSpace0:14;
      uint64_t AE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_ADDR_HIGH;

  uint8_t res11[508];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_ADDR_LOW;

  uint8_t res12[1532];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSENA:1;
      uint64_t TSCFUPDT:1;
      uint64_t TSINIT:1;
      uint64_t TSUPDT:1;
      uint64_t TSTRIG:1;
      uint64_t TADDREG:1;
      uint64_t reservedSpace0:2;
      uint64_t TSENALL:1;
      uint64_t TSCTRLSSR:1;
      uint64_t TSVER2ENA:1;
      uint64_t TSIPENA:1;
      uint64_t TSIPV6ENA:1;
      uint64_t TSIPV4ENA:1;
      uint64_t TSEVTENA:1;
      uint64_t TSMSTRENA:1;
      uint64_t SNAPTYPSEL:2;
      uint64_t TSENMACADDR:1;
      uint64_t reservedSpace1:5;
      uint64_t TXTTSSTSM:1;
      uint64_t reservedSpace2:3;
      uint64_t AV8021ASMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_TIMESTAMP_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t SSINC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_SUB_SCND_INCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_SYS_TIME_SCND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSSS:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_SYS_TIME_NSCND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_SYS_TIME_SCND_UPD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSSS:31;
      uint64_t ADDSUB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_SYS_TIME_NSCND_UPD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_SYS_TIMESTMP_ADDEND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSHWR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_SYS_TIME_HWORD_SCND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSSOVF:1;
      uint64_t TSTARGT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_SYS_TIMESTMP_STAT;

