iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
  uint8_t res13[220];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t DTXSTS:1;
      uint64_t RAA:1;
      uint64_t reservedSpace1:2;
      uint64_t SCHALG:2;
      uint64_t reservedSpace2:1;
      uint64_t CNTPRST:1;
      uint64_t CNTCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTL_OP_MODE;

  uint8_t res14[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Q0IS:1;
      uint64_t Q1IS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTL_INTR_STAT;

  uint8_t res15[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Q0MDMACH:1;
      uint64_t reservedSpace0:3;
      uint64_t Q0DDMACH:1;
      uint64_t reservedSpace1:3;
      uint64_t Q1MDMACH:1;
      uint64_t reservedSpace2:3;
      uint64_t Q1DDMACH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTL_RXQ_DMA_MAP;

  uint8_t res16[972];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWR:1;
      uint64_t DA:1;
      uint64_t TAA:3;
      uint64_t reservedSpace0:6;
      uint64_t TXPR:1;
      uint64_t PR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_MODE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FB:1;
      uint64_t reservedSpace0:11;
      uint64_t AAL:1;
      uint64_t reservedSpace1:1;
      uint64_t MB:1;
      uint64_t RB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_SYSBUS_MODE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DC0IS:1;
      uint64_t DC1IS:1;
      uint64_t reservedSpace0:14;
      uint64_t MTLIS:1;
      uint64_t MACIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_INTR_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AHSTS:1;
      uint64_t reservedSpace0:7;
      uint64_t RPS0:4;
      uint64_t TPS0:4;
      uint64_t RPS1:4;
      uint64_t TPS1:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_DBG_STAT;

};

#define ENET (*(volatile struct ENET_tag *) 0x40092000)

struct ENET_MTL_QUEUE_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTQ:1;
      uint64_t TSF:1;
      uint64_t TXQEN:2;
      uint64_t TTC:3;
      uint64_t reservedSpace0:9;
      uint64_t TQS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTL_TXQx_OP_MODE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UFFRMCNT:11;
      uint64_t UFCNTOVF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTL_TXQx_UNDRFLW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXQPAUSED:1;
      uint64_t TRCSTS:2;
      uint64_t TWCSTS:1;
      uint64_t TXQSTS:1;
      uint64_t TXSTSFSTS:1;
      uint64_t reservedSpace0:10;
      uint64_t PTXQ:3;
      uint64_t reservedSpace1:1;
      uint64_t STSXSTSF:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTL_TXQx_DBG;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ABS:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTL_TXQx_ETS_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISCQW:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTL_TXQx_QNTM_WGHT;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXUNFIS:1;
      uint64_t ABPSIS:1;
      uint64_t reservedSpace0:6;
      uint64_t TXUIE:1;
      uint64_t ABPSIE:1;
      uint64_t reservedSpace1:6;
      uint64_t RXOVFIS:1;
      uint64_t reservedSpace2:7;
      uint64_t RXOIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTL_TXQx_INTCTRL_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTC_bitfield:2;
      uint64_t reservedSpace0:1;
      uint64_t FUP:1;
      uint64_t FEP:1;
      uint64_t RSF:1;
      uint64_t DIS_TCP_EF:1;
      uint64_t reservedSpace1:13;
      uint64_t RQS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTL_RXQx_OP_MODE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVFPKTCNT:11;
      uint64_t OVFCNTOVF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTL_RXQx_MISSPKT_OVRFLW_CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RWCSTS:1;
      uint64_t RRCSTS:2;
      uint64_t reservedSpace0:1;
      uint64_t RXQSTS:2;
      uint64_t reservedSpace1:10;
      uint64_t PRXQ:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTL_RXQx_DBG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXQ_WEGT:3;
      uint64_t RXQ_FRM_ARBIT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTL_RXQx_CTRL;

};

#define ENET_MTL_QUEUE_0 (*(volatile struct ENET_MTL_QUEUE_0_tag *) 0x40092d00)

struct ENET_MTL_QUEUE_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTQ:1;
      uint64_t TSF:1;
      uint64_t TXQEN:2;
      uint64_t TTC:3;
      uint64_t reservedSpace0:9;
      uint64_t TQS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTL_TXQx_OP_MODE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UFFRMCNT:11;
      uint64_t UFCNTOVF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTL_TXQx_UNDRFLW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXQPAUSED:1;
      uint64_t TRCSTS:2;
      uint64_t TWCSTS:1;
      uint64_t TXQSTS:1;
      uint64_t TXSTSFSTS:1;
      uint64_t reservedSpace0:10;
      uint64_t PTXQ:3;
      uint64_t reservedSpace1:1;
      uint64_t STSXSTSF:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTL_TXQx_DBG;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ABS:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTL_TXQx_ETS_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISCQW:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTL_TXQx_QNTM_WGHT;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXUNFIS:1;
      uint64_t ABPSIS:1;
      uint64_t reservedSpace0:6;
      uint64_t TXUIE:1;
      uint64_t ABPSIE:1;
      uint64_t reservedSpace1:6;
      uint64_t RXOVFIS:1;
      uint64_t reservedSpace2:7;
      uint64_t RXOIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTL_TXQx_INTCTRL_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTC_bitfield:2;
      uint64_t reservedSpace0:1;
      uint64_t FUP:1;
      uint64_t FEP:1;
      uint64_t RSF:1;
      uint64_t DIS_TCP_EF:1;
      uint64_t reservedSpace1:13;
      uint64_t RQS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTL_RXQx_OP_MODE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVFPKTCNT:11;
      uint64_t OVFCNTOVF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTL_RXQx_MISSPKT_OVRFLW_CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RWCSTS:1;
      uint64_t RRCSTS:2;
      uint64_t reservedSpace0:1;
      uint64_t RXQSTS:2;
      uint64_t reservedSpace1:10;
      uint64_t PRXQ:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTL_RXQx_DBG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXQ_WEGT:3;
      uint64_t RXQ_FRM_ARBIT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTL_RXQx_CTRL;

