iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
};

#define ENET_MTL_QUEUE_1 (*(volatile struct ENET_MTL_QUEUE_1_tag *) 0x40092d40)

struct ENET_DMA_CH_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t PBLx8:1;
      uint64_t reservedSpace1:1;
      uint64_t DSL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ST:1;
      uint64_t TCW:3;
      uint64_t OSF:1;
      uint64_t reservedSpace0:11;
      uint64_t TxPBL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_TX_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SR:1;
      uint64_t reservedSpace0:2;
      uint64_t RBSZ:12;
      uint64_t reservedSpace1:1;
      uint64_t RxPBL:6;
      uint64_t reservedSpace2:9;
      uint64_t RPF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_RX_CTRL;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t STL:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_TXDESC_LIST_ADDR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t SRL:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_RXDESC_LIST_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t TDTP:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_TXDESC_TAIL_PTR;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RDTP:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_RXDESC_TAIL_PTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDRL:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_TXDESC_RING_LENGTH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDRL:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_RXDESC_RING_LENGTH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIE:1;
      uint64_t TSE:1;
      uint64_t TBUE:1;
      uint64_t reservedSpace0:3;
      uint64_t RIE:1;
      uint64_t RBUE:1;
      uint64_t RSE:1;
      uint64_t RWTE:1;
      uint64_t ETIE:1;
      uint64_t ERIE:1;
      uint64_t FBEE:1;
      uint64_t reservedSpace1:1;
      uint64_t AIE:1;
      uint64_t NIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_INT_EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RIWT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_RX_INT_WDTIMER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ESC:1;
      uint64_t ASC:1;
      uint64_t reservedSpace0:14;
      uint64_t RSN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_SLOT_FUNC_CTRL_STAT;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_CUR_HST_TXDESC;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HRD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_CUR_HST_RXDESC;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_CUR_HST_TXBUF;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HRB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_CUR_HST_RXBUF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TI:1;
      uint64_t TPS:1;
      uint64_t TBU:1;
      uint64_t reservedSpace0:3;
      uint64_t RI:1;
      uint64_t RBU:1;
      uint64_t RPS:1;
      uint64_t RWT:1;
      uint64_t ETI:1;
      uint64_t ERI:1;
      uint64_t FBE:1;
      uint64_t reservedSpace1:1;
      uint64_t AIS:1;
      uint64_t NIS:1;
      uint64_t EB:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_STAT;

};

#define ENET_DMA_CH_0 (*(volatile struct ENET_DMA_CH_0_tag *) 0x40093100)

struct ENET_DMA_CH_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t PBLx8:1;
      uint64_t reservedSpace1:1;
      uint64_t DSL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ST:1;
      uint64_t TCW:3;
      uint64_t OSF:1;
      uint64_t reservedSpace0:11;
      uint64_t TxPBL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_TX_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SR:1;
      uint64_t reservedSpace0:2;
      uint64_t RBSZ:12;
      uint64_t reservedSpace1:1;
      uint64_t RxPBL:6;
      uint64_t reservedSpace2:9;
      uint64_t RPF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_RX_CTRL;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t STL:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_TXDESC_LIST_ADDR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t SRL:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_RXDESC_LIST_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t TDTP:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_TXDESC_TAIL_PTR;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RDTP:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_RXDESC_TAIL_PTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDRL:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_TXDESC_RING_LENGTH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDRL:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_RXDESC_RING_LENGTH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIE:1;
      uint64_t TSE:1;
      uint64_t TBUE:1;
      uint64_t reservedSpace0:3;
      uint64_t RIE:1;
      uint64_t RBUE:1;
      uint64_t RSE:1;
      uint64_t RWTE:1;
      uint64_t ETIE:1;
      uint64_t ERIE:1;
      uint64_t FBEE:1;
      uint64_t reservedSpace1:1;
      uint64_t AIE:1;
      uint64_t NIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_INT_EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RIWT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_RX_INT_WDTIMER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ESC:1;
      uint64_t ASC:1;
      uint64_t reservedSpace0:14;
      uint64_t RSN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_SLOT_FUNC_CTRL_STAT;

