iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_CUR_HST_TXDESC;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HRD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_CUR_HST_RXDESC;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_CUR_HST_TXBUF;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HRB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_CUR_HST_RXBUF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TI:1;
      uint64_t TPS:1;
      uint64_t TBU:1;
      uint64_t reservedSpace0:3;
      uint64_t RI:1;
      uint64_t RBU:1;
      uint64_t RPS:1;
      uint64_t RWT:1;
      uint64_t ETI:1;
      uint64_t ERI:1;
      uint64_t FBE:1;
      uint64_t reservedSpace1:1;
      uint64_t AIS:1;
      uint64_t NIS:1;
      uint64_t EB:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHx_STAT;

};

#define ENET_DMA_CH_1 (*(volatile struct ENET_DMA_CH_1_tag *) 0x40093180)

struct USBHSD_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEV_ADDR:7;
      uint64_t DEV_EN:1;
      uint64_t SETUP:1;
      uint64_t FORCE_NEEDCLK:1;
      uint64_t FORCE_VBUS:1;
      uint64_t LPM_SUP:1;
      uint64_t INTONNAK_AO:1;
      uint64_t INTONNAK_AI:1;
      uint64_t INTONNAK_CO:1;
      uint64_t INTONNAK_CI:1;
      uint64_t DCON:1;
      uint64_t DSUS:1;
      uint64_t reservedSpace0:1;
      uint64_t LPM_SUS:1;
      uint64_t LPM_REWP:1;
      uint64_t reservedSpace1:1;
      uint64_t Speed:2;
      uint64_t DCON_C:1;
      uint64_t DSUS_C:1;
      uint64_t DRES_C:1;
      uint64_t reservedSpace2:1;
      uint64_t VBUS_DEBOUNCED:1;
      uint64_t PHY_TEST_MODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEVCMDSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRAME_NR:11;
      uint64_t ERR_CODE:4;
      uint64_t reservedSpace0:1;
      uint64_t Minrev:8;
      uint64_t Majrev:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INFO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t EP_LIST_PRG:12;
      uint64_t EP_LIST_FIXED:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPLISTSTART;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DA_BUF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATABUFSTART;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIRD_HW:4;
      uint64_t HIRD_SW:4;
      uint64_t DATA_PENDING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SKIP:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPSKIP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t BUF:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPINUSE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t BUF_SB:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPBUFCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EP0OUT:1;
      uint64_t EP0IN:1;
      uint64_t EP1OUT:1;
      uint64_t EP1IN:1;
      uint64_t EP2OUT:1;
      uint64_t EP2IN:1;
      uint64_t EP3OUT:1;
      uint64_t EP3IN:1;
      uint64_t EP4OUT:1;
      uint64_t EP4IN:1;
      uint64_t EP5OUT:1;
      uint64_t EP5IN:1;
      uint64_t reservedSpace0:18;
      uint64_t FRAME_INT:1;
      uint64_t DEV_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EP_INT_EN:12;
      uint64_t reservedSpace0:18;
      uint64_t FRAME_INT_EN:1;
      uint64_t DEV_INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EP_SET_INT:12;
      uint64_t reservedSpace0:18;
      uint64_t FRAME_SET_INT:1;
      uint64_t DEV_SET_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSETSTAT;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOGGLE:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPTOGGLE;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PHY_ADDR:8;
      uint64_t PHY_WDATA:8;
      uint64_t PHY_RDATA:8;
      uint64_t PHY_RW:1;
      uint64_t PHY_ACCESS:1;
      uint64_t reservedSpace0:5;
      uint64_t PHY_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ULPIDEBUG;

};

#define USBHSD (*(volatile struct USBHSD_tag *) 0x40094000)

struct USART5_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t reservedSpace0:1;
      uint64_t DATALEN:2;
      uint64_t PARITYSEL:2;
      uint64_t STOPLEN:1;
      uint64_t MODE32K:1;
      uint64_t LINMODE:1;
      uint64_t CTSEN:1;
      uint64_t reservedSpace1:1;
      uint64_t SYNCEN:1;
      uint64_t CLKPOL:1;
      uint64_t reservedSpace2:1;
      uint64_t SYNCMST:1;
      uint64_t LOOP:1;
      uint64_t IOMODE:1;
      uint64_t reservedSpace3:1;
      uint64_t OETA:1;
      uint64_t AUTOADDR:1;
      uint64_t OESEL:1;
      uint64_t OEPOL:1;
      uint64_t RXPOL:1;
      uint64_t TXPOL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t TXBRKEN:1;
      uint64_t ADDRDET:1;
      uint64_t reservedSpace1:3;
      uint64_t TXDIS:1;
      uint64_t reservedSpace2:1;
      uint64_t CC:1;
      uint64_t CLRCCONRX:1;
      uint64_t reservedSpace3:6;
      uint64_t AUTOBAUD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t RXIDLE:1;
      uint64_t reservedSpace1:1;
      uint64_t TXIDLE:1;
      uint64_t CTS:1;
      uint64_t DELTACTS:1;
      uint64_t TXDISSTAT:1;
      uint64_t reservedSpace2:3;
      uint64_t RXBRK:1;
      uint64_t DELTARXBRK:1;
      uint64_t START:1;
      uint64_t FRAMERRINT:1;
      uint64_t PARITYERRINT:1;
      uint64_t RXNOISEINT:1;
      uint64_t ABERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t TXIDLEEN:1;
      uint64_t reservedSpace1:1;
      uint64_t DELTACTSEN:1;
      uint64_t TXDISEN:1;
      uint64_t reservedSpace2:4;
      uint64_t DELTARXBRKEN:1;
      uint64_t STARTEN:1;
      uint64_t FRAMERREN:1;
      uint64_t PARITYERREN:1;
      uint64_t RXNOISEEN:1;
      uint64_t ABERREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t TXIDLECLR:1;
      uint64_t reservedSpace1:1;
      uint64_t DELTACTSCLR:1;
      uint64_t TXDISCLR:1;
      uint64_t reservedSpace2:4;
      uint64_t DELTARXBRKCLR:1;
      uint64_t STARTCLR:1;
      uint64_t FRAMERRCLR:1;
      uint64_t PARITYERRCLR:1;
      uint64_t RXNOISECLR:1;
      uint64_t ABERRCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENCLR;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BRGVAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t TXIDLE:1;
      uint64_t reservedSpace1:1;
      uint64_t DELTACTS:1;
      uint64_t TXDISINT:1;
      uint64_t reservedSpace2:1;
      uint64_t OVERRUNINT:1;
      uint64_t reservedSpace3:2;
      uint64_t DELTARXBRK:1;
      uint64_t START:1;
      uint64_t FRAMERRINT:1;
      uint64_t PARITYERRINT:1;
      uint64_t RXNOISEINT:1;
      uint64_t ABERRINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSRVAL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRESS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADDR;

  uint8_t res1[3536];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLETX:1;
      uint64_t ENABLERX:1;
      uint64_t reservedSpace0:2;
      uint64_t SIZE:2;
      uint64_t reservedSpace1:6;
      uint64_t DMATX:1;
      uint64_t DMARX:1;
      uint64_t WAKETX:1;
      uint64_t WAKERX:1;
      uint64_t EMPTYTX:1;
      uint64_t EMPTYRX:1;
      uint64_t POPDBG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t reservedSpace0:1;
      uint64_t PERINT:1;
      uint64_t TXEMPTY:1;
      uint64_t TXNOTFULL:1;
      uint64_t RXNOTEMPTY:1;
      uint64_t RXFULL:1;
      uint64_t TXLVL:5;
      uint64_t reservedSpace1:3;
      uint64_t RXLVL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXLVLENA:1;
      uint64_t RXLVLENA:1;
      uint64_t reservedSpace0:6;
      uint64_t TXLVL:4;
      uint64_t reservedSpace1:4;
      uint64_t RXLVL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOTRIG;

