iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
};

#define SPI5 (*(volatile struct SPI5_tag *) 0x40096400)

struct I2C5_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTEN:1;
      uint64_t SLVEN:1;
      uint64_t MONEN:1;
      uint64_t TIMEOUTEN:1;
      uint64_t MONCLKSTR:1;
      uint64_t HSCAPABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTPENDING:1;
      uint64_t MSTSTATE:3;
      uint64_t MSTARBLOSS:1;
      uint64_t reservedSpace0:1;
      uint64_t MSTSTSTPERR:1;
      uint64_t reservedSpace1:1;
      uint64_t SLVPENDING:1;
      uint64_t SLVSTATE:2;
      uint64_t SLVNOTSTR:1;
      uint64_t SLVIDX:2;
      uint64_t SLVSEL:1;
      uint64_t SLVDESEL:1;
      uint64_t MONRDY:1;
      uint64_t MONOV:1;
      uint64_t MONACTIVE:1;
      uint64_t MONIDLE:1;
      uint64_t reservedSpace2:4;
      uint64_t EVENTTIMEOUT:1;
      uint64_t SCLTIMEOUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTPENDINGEN:1;
      uint64_t reservedSpace0:3;
      uint64_t MSTARBLOSSEN:1;
      uint64_t reservedSpace1:1;
      uint64_t MSTSTSTPERREN:1;
      uint64_t reservedSpace2:1;
      uint64_t SLVPENDINGEN:1;
      uint64_t reservedSpace3:2;
      uint64_t SLVNOTSTREN:1;
      uint64_t reservedSpace4:3;
      uint64_t SLVDESELEN:1;
      uint64_t MONRDYEN:1;
      uint64_t MONOVEN:1;
      uint64_t reservedSpace5:1;
      uint64_t MONIDLEEN:1;
      uint64_t reservedSpace6:4;
      uint64_t EVENTTIMEOUTEN:1;
      uint64_t SCLTIMEOUTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTPENDINGCLR:1;
      uint64_t reservedSpace0:3;
      uint64_t MSTARBLOSSCLR:1;
      uint64_t reservedSpace1:1;
      uint64_t MSTSTSTPERRCLR:1;
      uint64_t reservedSpace2:1;
      uint64_t SLVPENDINGCLR:1;
      uint64_t reservedSpace3:2;
      uint64_t SLVNOTSTRCLR:1;
      uint64_t reservedSpace4:3;
      uint64_t SLVDESELCLR:1;
      uint64_t MONRDYCLR:1;
      uint64_t MONOVCLR:1;
      uint64_t reservedSpace5:1;
      uint64_t MONIDLECLR:1;
      uint64_t reservedSpace6:4;
      uint64_t EVENTTIMEOUTCLR:1;
      uint64_t SCLTIMEOUTCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOMIN:4;
      uint64_t TO:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMEOUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVVAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTPENDING:1;
      uint64_t reservedSpace0:3;
      uint64_t MSTARBLOSS:1;
      uint64_t reservedSpace1:1;
      uint64_t MSTSTSTPERR:1;
      uint64_t reservedSpace2:1;
      uint64_t SLVPENDING:1;
      uint64_t reservedSpace3:2;
      uint64_t SLVNOTSTR:1;
      uint64_t reservedSpace4:3;
      uint64_t SLVDESEL:1;
      uint64_t MONRDY:1;
      uint64_t MONOV:1;
      uint64_t reservedSpace5:1;
      uint64_t MONIDLE:1;
      uint64_t reservedSpace6:4;
      uint64_t EVENTTIMEOUT:1;
      uint64_t SCLTIMEOUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTCONTINUE:1;
      uint64_t MSTSTART:1;
      uint64_t MSTSTOP:1;
      uint64_t MSTDMA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSTCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTSCLLOW:3;
      uint64_t reservedSpace0:1;
      uint64_t MSTSCLHIGH:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSTTIME;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSTDAT;

  uint8_t res1[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLVCONTINUE:1;
      uint64_t SLVNACK:1;
      uint64_t reservedSpace0:1;
      uint64_t SLVDMA:1;
      uint64_t reservedSpace1:4;
      uint64_t AUTOACK:1;
      uint64_t AUTOMATCHREAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SLVCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SLVDAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SADISABLE:1;
      uint64_t SLVADR:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SLVADR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SADISABLE:1;
      uint64_t SLVADR:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SLVADR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SADISABLE:1;
      uint64_t SLVADR:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SLVADR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SADISABLE:1;
      uint64_t SLVADR:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SLVADR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QUALMODE0:1;
      uint64_t SLVQUAL0:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SLVQUAL0;

  uint8_t res2[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MONRXDAT:8;
      uint64_t MONSTART:1;
      uint64_t MONRESTART:1;
      uint64_t MONNACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MONRXDAT;

};

#define I2C5 (*(volatile struct I2C5_tag *) 0x40096800)

struct USART6_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t reservedSpace0:1;
      uint64_t DATALEN:2;
      uint64_t PARITYSEL:2;
      uint64_t STOPLEN:1;
      uint64_t MODE32K:1;
      uint64_t LINMODE:1;
      uint64_t CTSEN:1;
      uint64_t reservedSpace1:1;
      uint64_t SYNCEN:1;
      uint64_t CLKPOL:1;
      uint64_t reservedSpace2:1;
      uint64_t SYNCMST:1;
      uint64_t LOOP:1;
      uint64_t IOMODE:1;
      uint64_t reservedSpace3:1;
      uint64_t OETA:1;
      uint64_t AUTOADDR:1;
      uint64_t OESEL:1;
      uint64_t OEPOL:1;
      uint64_t RXPOL:1;
      uint64_t TXPOL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t TXBRKEN:1;
      uint64_t ADDRDET:1;
      uint64_t reservedSpace1:3;
      uint64_t TXDIS:1;
      uint64_t reservedSpace2:1;
      uint64_t CC:1;
      uint64_t CLRCCONRX:1;
      uint64_t reservedSpace3:6;
      uint64_t AUTOBAUD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t RXIDLE:1;
      uint64_t reservedSpace1:1;
      uint64_t TXIDLE:1;
      uint64_t CTS:1;
      uint64_t DELTACTS:1;
      uint64_t TXDISSTAT:1;
      uint64_t reservedSpace2:3;
      uint64_t RXBRK:1;
      uint64_t DELTARXBRK:1;
      uint64_t START:1;
      uint64_t FRAMERRINT:1;
      uint64_t PARITYERRINT:1;
      uint64_t RXNOISEINT:1;
      uint64_t ABERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t TXIDLEEN:1;
      uint64_t reservedSpace1:1;
      uint64_t DELTACTSEN:1;
      uint64_t TXDISEN:1;
      uint64_t reservedSpace2:4;
      uint64_t DELTARXBRKEN:1;
      uint64_t STARTEN:1;
      uint64_t FRAMERREN:1;
      uint64_t PARITYERREN:1;
      uint64_t RXNOISEEN:1;
      uint64_t ABERREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t TXIDLECLR:1;
      uint64_t reservedSpace1:1;
      uint64_t DELTACTSCLR:1;
      uint64_t TXDISCLR:1;
      uint64_t reservedSpace2:4;
      uint64_t DELTARXBRKCLR:1;
      uint64_t STARTCLR:1;
      uint64_t FRAMERRCLR:1;
      uint64_t PARITYERRCLR:1;
      uint64_t RXNOISECLR:1;
      uint64_t ABERRCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENCLR;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BRGVAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t TXIDLE:1;
      uint64_t reservedSpace1:1;
      uint64_t DELTACTS:1;
      uint64_t TXDISINT:1;
      uint64_t reservedSpace2:1;
      uint64_t OVERRUNINT:1;
      uint64_t reservedSpace3:2;
      uint64_t DELTARXBRK:1;
      uint64_t START:1;
      uint64_t FRAMERRINT:1;
      uint64_t PARITYERRINT:1;
      uint64_t RXNOISEINT:1;
      uint64_t ABERRINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSRVAL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRESS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADDR;

  uint8_t res1[3536];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLETX:1;
      uint64_t ENABLERX:1;
      uint64_t reservedSpace0:2;
      uint64_t SIZE:2;
      uint64_t reservedSpace1:6;
      uint64_t DMATX:1;
      uint64_t DMARX:1;
      uint64_t WAKETX:1;
      uint64_t WAKERX:1;
      uint64_t EMPTYTX:1;
      uint64_t EMPTYRX:1;
      uint64_t POPDBG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t reservedSpace0:1;
      uint64_t PERINT:1;
      uint64_t TXEMPTY:1;
      uint64_t TXNOTFULL:1;
      uint64_t RXNOTEMPTY:1;
      uint64_t RXFULL:1;
      uint64_t TXLVL:5;
      uint64_t reservedSpace1:3;
      uint64_t RXLVL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXLVLENA:1;
      uint64_t RXLVLENA:1;
      uint64_t reservedSpace0:6;
      uint64_t TXLVL:4;
      uint64_t reservedSpace1:4;
      uint64_t RXLVL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOTRIG;

