iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
};

#define I2C6 (*(volatile struct I2C6_tag *) 0x40097800)

struct SPI6_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t reservedSpace0:1;
      uint64_t MASTER:1;
      uint64_t LSBF:1;
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t reservedSpace1:1;
      uint64_t LOOP:1;
      uint64_t SPOL0:1;
      uint64_t SPOL1:1;
      uint64_t SPOL2:1;
      uint64_t SPOL3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRE_DELAY:4;
      uint64_t POST_DELAY:4;
      uint64_t FRAME_DELAY:4;
      uint64_t TRANSFER_DELAY:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t SSA:1;
      uint64_t SSD:1;
      uint64_t STALLED:1;
      uint64_t ENDTRANSFER:1;
      uint64_t MSTIDLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t SSAEN:1;
      uint64_t SSDEN:1;
      uint64_t reservedSpace1:2;
      uint64_t MSTIDLEEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t SSAEN:1;
      uint64_t SSDEN:1;
      uint64_t reservedSpace1:2;
      uint64_t MSTIDLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENCLR;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVVAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t SSA:1;
      uint64_t SSD:1;
      uint64_t reservedSpace1:2;
      uint64_t MSTIDLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  uint8_t res1[2516];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLETX:1;
      uint64_t ENABLERX:1;
      uint64_t reservedSpace0:2;
      uint64_t SIZE:2;
      uint64_t reservedSpace1:6;
      uint64_t DMATX:1;
      uint64_t DMARX:1;
      uint64_t WAKETX:1;
      uint64_t WAKERX:1;
      uint64_t EMPTYTX:1;
      uint64_t EMPTYRX:1;
      uint64_t POPDBG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t reservedSpace0:1;
      uint64_t PERINT:1;
      uint64_t TXEMPTY:1;
      uint64_t TXNOTFULL:1;
      uint64_t RXNOTEMPTY:1;
      uint64_t RXFULL:1;
      uint64_t TXLVL:5;
      uint64_t reservedSpace1:3;
      uint64_t RXLVL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXLVLENA:1;
      uint64_t RXLVLENA:1;
      uint64_t reservedSpace0:6;
      uint64_t TXLVL:4;
      uint64_t reservedSpace1:4;
      uint64_t RXLVL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOTRIG;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t TXLVL:1;
      uint64_t RXLVL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOINTENSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t TXLVL:1;
      uint64_t RXLVL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOINTENCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t TXLVL:1;
      uint64_t RXLVL:1;
      uint64_t PERINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOINTSTAT;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t TXSSEL0_N:1;
      uint64_t TXSSEL1_N:1;
      uint64_t TXSSEL2_N:1;
      uint64_t TXSSEL3_N:1;
      uint64_t EOT:1;
      uint64_t EOF:1;
      uint64_t RXIGNORE:1;
      uint64_t reservedSpace0:1;
      uint64_t LEN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOWR;

  uint8_t res4[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:16;
      uint64_t RXSSEL0_N:1;
      uint64_t RXSSEL1_N:1;
      uint64_t RXSSEL2_N:1;
      uint64_t RXSSEL3_N:1;
      uint64_t SOT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFORD;

  uint8_t res5[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:16;
      uint64_t RXSSEL0_N:1;
      uint64_t RXSSEL1_N:1;
      uint64_t RXSSEL2_N:1;
      uint64_t RXSSEL3_N:1;
      uint64_t SOT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFORDNOPOP;

};

#define SPI6 (*(volatile struct SPI6_tag *) 0x40097400)

struct I2C7_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTEN:1;
      uint64_t SLVEN:1;
      uint64_t MONEN:1;
      uint64_t TIMEOUTEN:1;
      uint64_t MONCLKSTR:1;
      uint64_t HSCAPABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTPENDING:1;
      uint64_t MSTSTATE:3;
      uint64_t MSTARBLOSS:1;
      uint64_t reservedSpace0:1;
      uint64_t MSTSTSTPERR:1;
      uint64_t reservedSpace1:1;
      uint64_t SLVPENDING:1;
      uint64_t SLVSTATE:2;
      uint64_t SLVNOTSTR:1;
      uint64_t SLVIDX:2;
      uint64_t SLVSEL:1;
      uint64_t SLVDESEL:1;
      uint64_t MONRDY:1;
      uint64_t MONOV:1;
      uint64_t MONACTIVE:1;
      uint64_t MONIDLE:1;
      uint64_t reservedSpace2:4;
      uint64_t EVENTTIMEOUT:1;
      uint64_t SCLTIMEOUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTPENDINGEN:1;
      uint64_t reservedSpace0:3;
      uint64_t MSTARBLOSSEN:1;
      uint64_t reservedSpace1:1;
      uint64_t MSTSTSTPERREN:1;
      uint64_t reservedSpace2:1;
      uint64_t SLVPENDINGEN:1;
      uint64_t reservedSpace3:2;
      uint64_t SLVNOTSTREN:1;
      uint64_t reservedSpace4:3;
      uint64_t SLVDESELEN:1;
      uint64_t MONRDYEN:1;
      uint64_t MONOVEN:1;
      uint64_t reservedSpace5:1;
      uint64_t MONIDLEEN:1;
      uint64_t reservedSpace6:4;
      uint64_t EVENTTIMEOUTEN:1;
      uint64_t SCLTIMEOUTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTPENDINGCLR:1;
      uint64_t reservedSpace0:3;
      uint64_t MSTARBLOSSCLR:1;
      uint64_t reservedSpace1:1;
      uint64_t MSTSTSTPERRCLR:1;
      uint64_t reservedSpace2:1;
      uint64_t SLVPENDINGCLR:1;
      uint64_t reservedSpace3:2;
      uint64_t SLVNOTSTRCLR:1;
      uint64_t reservedSpace4:3;
      uint64_t SLVDESELCLR:1;
      uint64_t MONRDYCLR:1;
      uint64_t MONOVCLR:1;
      uint64_t reservedSpace5:1;
      uint64_t MONIDLECLR:1;
      uint64_t reservedSpace6:4;
      uint64_t EVENTTIMEOUTCLR:1;
      uint64_t SCLTIMEOUTCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOMIN:4;
      uint64_t TO:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMEOUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVVAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTPENDING:1;
      uint64_t reservedSpace0:3;
      uint64_t MSTARBLOSS:1;
      uint64_t reservedSpace1:1;
      uint64_t MSTSTSTPERR:1;
      uint64_t reservedSpace2:1;
      uint64_t SLVPENDING:1;
      uint64_t reservedSpace3:2;
      uint64_t SLVNOTSTR:1;
      uint64_t reservedSpace4:3;
      uint64_t SLVDESEL:1;
      uint64_t MONRDY:1;
      uint64_t MONOV:1;
      uint64_t reservedSpace5:1;
      uint64_t MONIDLE:1;
      uint64_t reservedSpace6:4;
      uint64_t EVENTTIMEOUT:1;
      uint64_t SCLTIMEOUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

