iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTCONTINUE:1;
      uint64_t MSTSTART:1;
      uint64_t MSTSTOP:1;
      uint64_t MSTDMA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSTCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTSCLLOW:3;
      uint64_t reservedSpace0:1;
      uint64_t MSTSCLHIGH:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSTTIME;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSTDAT;

  uint8_t res1[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLVCONTINUE:1;
      uint64_t SLVNACK:1;
      uint64_t reservedSpace0:1;
      uint64_t SLVDMA:1;
      uint64_t reservedSpace1:4;
      uint64_t AUTOACK:1;
      uint64_t AUTOMATCHREAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SLVCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SLVDAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SADISABLE:1;
      uint64_t SLVADR:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SLVADR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SADISABLE:1;
      uint64_t SLVADR:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SLVADR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SADISABLE:1;
      uint64_t SLVADR:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SLVADR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SADISABLE:1;
      uint64_t SLVADR:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SLVADR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QUALMODE0:1;
      uint64_t SLVQUAL0:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SLVQUAL0;

  uint8_t res2[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MONRXDAT:8;
      uint64_t MONSTART:1;
      uint64_t MONRESTART:1;
      uint64_t MONNACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MONRXDAT;

};

#define I2C7 (*(volatile struct I2C7_tag *) 0x40098800)

struct SPI7_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t reservedSpace0:1;
      uint64_t MASTER:1;
      uint64_t LSBF:1;
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t reservedSpace1:1;
      uint64_t LOOP:1;
      uint64_t SPOL0:1;
      uint64_t SPOL1:1;
      uint64_t SPOL2:1;
      uint64_t SPOL3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRE_DELAY:4;
      uint64_t POST_DELAY:4;
      uint64_t FRAME_DELAY:4;
      uint64_t TRANSFER_DELAY:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t SSA:1;
      uint64_t SSD:1;
      uint64_t STALLED:1;
      uint64_t ENDTRANSFER:1;
      uint64_t MSTIDLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t SSAEN:1;
      uint64_t SSDEN:1;
      uint64_t reservedSpace1:2;
      uint64_t MSTIDLEEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t SSAEN:1;
      uint64_t SSDEN:1;
      uint64_t reservedSpace1:2;
      uint64_t MSTIDLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENCLR;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVVAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t SSA:1;
      uint64_t SSD:1;
      uint64_t reservedSpace1:2;
      uint64_t MSTIDLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  uint8_t res1[2516];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLETX:1;
      uint64_t ENABLERX:1;
      uint64_t reservedSpace0:2;
      uint64_t SIZE:2;
      uint64_t reservedSpace1:6;
      uint64_t DMATX:1;
      uint64_t DMARX:1;
      uint64_t WAKETX:1;
      uint64_t WAKERX:1;
      uint64_t EMPTYTX:1;
      uint64_t EMPTYRX:1;
      uint64_t POPDBG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t reservedSpace0:1;
      uint64_t PERINT:1;
      uint64_t TXEMPTY:1;
      uint64_t TXNOTFULL:1;
      uint64_t RXNOTEMPTY:1;
      uint64_t RXFULL:1;
      uint64_t TXLVL:5;
      uint64_t reservedSpace1:3;
      uint64_t RXLVL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXLVLENA:1;
      uint64_t RXLVLENA:1;
      uint64_t reservedSpace0:6;
      uint64_t TXLVL:4;
      uint64_t reservedSpace1:4;
      uint64_t RXLVL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOTRIG;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t TXLVL:1;
      uint64_t RXLVL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOINTENSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t TXLVL:1;
      uint64_t RXLVL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOINTENCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t TXLVL:1;
      uint64_t RXLVL:1;
      uint64_t PERINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOINTSTAT;

