iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
};

#define I2C9 (*(volatile struct I2C9_tag *) 0x4009a800)

struct SPI9_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t reservedSpace0:1;
      uint64_t MASTER:1;
      uint64_t LSBF:1;
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t reservedSpace1:1;
      uint64_t LOOP:1;
      uint64_t SPOL0:1;
      uint64_t SPOL1:1;
      uint64_t SPOL2:1;
      uint64_t SPOL3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRE_DELAY:4;
      uint64_t POST_DELAY:4;
      uint64_t FRAME_DELAY:4;
      uint64_t TRANSFER_DELAY:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t SSA:1;
      uint64_t SSD:1;
      uint64_t STALLED:1;
      uint64_t ENDTRANSFER:1;
      uint64_t MSTIDLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t SSAEN:1;
      uint64_t SSDEN:1;
      uint64_t reservedSpace1:2;
      uint64_t MSTIDLEEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t SSAEN:1;
      uint64_t SSDEN:1;
      uint64_t reservedSpace1:2;
      uint64_t MSTIDLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENCLR;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVVAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t SSA:1;
      uint64_t SSD:1;
      uint64_t reservedSpace1:2;
      uint64_t MSTIDLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  uint8_t res1[2516];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLETX:1;
      uint64_t ENABLERX:1;
      uint64_t reservedSpace0:2;
      uint64_t SIZE:2;
      uint64_t reservedSpace1:6;
      uint64_t DMATX:1;
      uint64_t DMARX:1;
      uint64_t WAKETX:1;
      uint64_t WAKERX:1;
      uint64_t EMPTYTX:1;
      uint64_t EMPTYRX:1;
      uint64_t POPDBG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t reservedSpace0:1;
      uint64_t PERINT:1;
      uint64_t TXEMPTY:1;
      uint64_t TXNOTFULL:1;
      uint64_t RXNOTEMPTY:1;
      uint64_t RXFULL:1;
      uint64_t TXLVL:5;
      uint64_t reservedSpace1:3;
      uint64_t RXLVL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXLVLENA:1;
      uint64_t RXLVLENA:1;
      uint64_t reservedSpace0:6;
      uint64_t TXLVL:4;
      uint64_t reservedSpace1:4;
      uint64_t RXLVL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOTRIG;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t TXLVL:1;
      uint64_t RXLVL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOINTENSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t TXLVL:1;
      uint64_t RXLVL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOINTENCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t TXLVL:1;
      uint64_t RXLVL:1;
      uint64_t PERINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOINTSTAT;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t TXSSEL0_N:1;
      uint64_t TXSSEL1_N:1;
      uint64_t TXSSEL2_N:1;
      uint64_t TXSSEL3_N:1;
      uint64_t EOT:1;
      uint64_t EOF:1;
      uint64_t RXIGNORE:1;
      uint64_t reservedSpace0:1;
      uint64_t LEN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOWR;

  uint8_t res4[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:16;
      uint64_t RXSSEL0_N:1;
      uint64_t RXSSEL1_N:1;
      uint64_t RXSSEL2_N:1;
      uint64_t RXSSEL3_N:1;
      uint64_t SOT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFORD;

  uint8_t res5[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:16;
      uint64_t RXSSEL0_N:1;
      uint64_t RXSSEL1_N:1;
      uint64_t RXSSEL2_N:1;
      uint64_t RXSSEL3_N:1;
      uint64_t SOT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFORDNOPOP;

};

#define SPI9 (*(volatile struct SPI9_tag *) 0x4009a400)

struct SDIO_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONTROLLER_RESET:1;
      uint64_t FIFO_RESET:1;
      uint64_t DMA_RESET:1;
      uint64_t reservedSpace0:1;
      uint64_t INT_ENABLE:1;
      uint64_t reservedSpace1:1;
      uint64_t READ_WAIT:1;
      uint64_t SEND_IRQ_RESPONSE:1;
      uint64_t ABORT_READ_DATA:1;
      uint64_t SEND_CCSD:1;
      uint64_t SEND_AUTO_STOP_CCSD:1;
      uint64_t CEATA_DEVICE_INTERRUPT_STATUS:1;
      uint64_t reservedSpace2:4;
      uint64_t CARD_VOLTAGE_A0:1;
      uint64_t CARD_VOLTAGE_A1:1;
      uint64_t CARD_VOLTAGE_A2:1;
      uint64_t reservedSpace3:6;
      uint64_t USE_INTERNAL_DMAC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POWER_ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWREN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_DIVIDER0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKDIV;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCLK_ENABLE:1;
      uint64_t reservedSpace0:15;
      uint64_t CCLK_LOW_POWER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKENA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESPONSE_TIMEOUT:8;
      uint64_t DATA_TIMEOUT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMOUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CARD_WIDTH0:1;
      uint64_t reservedSpace0:15;
      uint64_t CARD_WIDTH1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCK_SIZE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLKSIZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BYTE_COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BYTCNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDET:1;
      uint64_t RE:1;
      uint64_t CDONE:1;
      uint64_t DTO:1;
      uint64_t TXDR:1;
      uint64_t RXDR:1;
      uint64_t RCRC:1;
      uint64_t DCRC:1;
      uint64_t RTO:1;
      uint64_t DRTO:1;
      uint64_t HTO:1;
      uint64_t FRUN:1;
      uint64_t HLE:1;
      uint64_t SBE:1;
      uint64_t ACD:1;
      uint64_t EBE:1;
      uint64_t SDIO_INT_MASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTMASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMD_ARG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDARG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMD_INDEX:6;
      uint64_t RESPONSE_EXPECT:1;
      uint64_t RESPONSE_LENGTH:1;
      uint64_t CHECK_RESPONSE_CRC:1;
      uint64_t DATA_EXPECTED:1;
      uint64_t READ_WRITE:1;
      uint64_t TRANSFER_MODE:1;
      uint64_t SEND_AUTO_STOP:1;
      uint64_t WAIT_PRVDATA_COMPLETE:1;
      uint64_t STOP_ABORT_CMD:1;
      uint64_t SEND_INITIALIZATION:1;
      uint64_t reservedSpace0:5;
      uint64_t UPDATE_CLOCK_REGISTERS_ONLY:1;
      uint64_t READ_CEATA_DEVICE:1;
      uint64_t CCS_EXPECTED:1;
      uint64_t ENABLE_BOOT:1;
      uint64_t EXPECT_BOOT_ACK:1;
      uint64_t DISABLE_BOOT:1;
      uint64_t BOOT_MODE:1;
      uint64_t VOLT_SWITCH:1;
      uint64_t USE_HOLD_REG:1;
      uint64_t reservedSpace1:1;
      uint64_t START_CMD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESPONSE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESP_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESPONSE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESP_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESPONSE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESP_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESPONSE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESP_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDET:1;
      uint64_t RE:1;
      uint64_t CDONE:1;
      uint64_t DTO:1;
      uint64_t TXDR:1;
      uint64_t RXDR:1;
      uint64_t RCRC:1;
      uint64_t DCRC:1;
      uint64_t RTO:1;
      uint64_t DRTO:1;
      uint64_t HTO:1;
      uint64_t FRUN:1;
      uint64_t HLE:1;
      uint64_t SBE:1;
      uint64_t ACD:1;
      uint64_t EBE:1;
      uint64_t SDIO_INTERRUPT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MINTSTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDET:1;
      uint64_t RE:1;
      uint64_t CDONE:1;
      uint64_t DTO:1;
      uint64_t TXDR:1;
      uint64_t RXDR:1;
      uint64_t RCRC:1;
      uint64_t DCRC:1;
      uint64_t RTO_BAR:1;
      uint64_t DRTO_BDS:1;
      uint64_t HTO:1;
      uint64_t FRUN:1;
      uint64_t HLE:1;
      uint64_t SBE:1;
      uint64_t ACD:1;
      uint64_t EBE:1;
      uint64_t SDIO_INTERRUPT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RINTSTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIFO_RX_WATERMARK:1;
      uint64_t FIFO_TX_WATERMARK:1;
      uint64_t FIFO_EMPTY:1;
      uint64_t FIFO_FULL:1;
      uint64_t CMDFSMSTATES:4;
      uint64_t DATA_3_STATUS:1;
      uint64_t DATA_BUSY:1;
      uint64_t DATA_STATE_MC_BUSY:1;
      uint64_t RESPONSE_INDEX:6;
      uint64_t FIFO_COUNT:13;
      uint64_t DMA_ACK:1;
      uint64_t DMA_REQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_WMARK:12;
      uint64_t reservedSpace0:4;
      uint64_t RX_WMARK:12;
      uint64_t DMA_MTS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOTH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CARD_DETECT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDETECT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRITE_PROTECT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WRTPRT;

