iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t EFSA:14;
      uint64_t EFS:6;
      uint64_t reservedSpace1:2;
      uint64_t EFWM:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXEFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFFL:6;
      uint64_t reservedSpace0:2;
      uint64_t EFGI:5;
      uint64_t reservedSpace1:3;
      uint64_t EFPI:6;
      uint64_t reservedSpace2:2;
      uint64_t EFF:1;
      uint64_t TEFL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXEFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFAI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXEFA;

  uint8_t res5[260];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MS;

  uint8_t res6[508];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ETCP:11;
      uint64_t reservedSpace0:20;
      uint64_t ETCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETSCC;

  uint8_t res7[508];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ETSC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETSCV;

};

#define CANFD1 (*(volatile struct CANFD1_tag *) 0x4009e00c)

struct ADC0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKDIV:8;
      uint64_t ASYNMODE:1;
      uint64_t RESOL:2;
      uint64_t BYPASSCAL:1;
      uint64_t TSAMP:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNELS:12;
      uint64_t TRIGGER:6;
      uint64_t TRIGPOL:1;
      uint64_t SYNCBYPASS:1;
      uint64_t reservedSpace0:6;
      uint64_t START:1;
      uint64_t BURST:1;
      uint64_t SINGLESTEP:1;
      uint64_t LOWPRIO:1;
      uint64_t MODE:1;
      uint64_t SEQ_ENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEQ_CTRL_A;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNELS:12;
      uint64_t TRIGGER:6;
      uint64_t TRIGPOL:1;
      uint64_t SYNCBYPASS:1;
      uint64_t reservedSpace0:6;
      uint64_t START:1;
      uint64_t BURST:1;
      uint64_t SINGLESTEP:1;
      uint64_t LOWPRIO:1;
      uint64_t MODE:1;
      uint64_t SEQ_ENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEQ_CTRL_B;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t RESULT:12;
      uint64_t THCMPRANGE:2;
      uint64_t THCMPCROSS:2;
      uint64_t reservedSpace1:6;
      uint64_t CHN:4;
      uint64_t OVERRUN:1;
      uint64_t DATAVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEQ_GDAT_A;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t RESULT:12;
      uint64_t THCMPRANGE:2;
      uint64_t THCMPCROSS:2;
      uint64_t reservedSpace1:6;
      uint64_t CHN:4;
      uint64_t OVERRUN:1;
      uint64_t DATAVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEQ_GDAT_B;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t RESULT:12;
      uint64_t THCMPRANGE:2;
      uint64_t THCMPCROSS:2;
      uint64_t reservedSpace1:6;
      uint64_t CHANNEL:4;
      uint64_t OVERRUN:1;
      uint64_t DATAVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAT_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t RESULT:12;
      uint64_t THCMPRANGE:2;
      uint64_t THCMPCROSS:2;
      uint64_t reservedSpace1:6;
      uint64_t CHANNEL:4;
      uint64_t OVERRUN:1;
      uint64_t DATAVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAT_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t RESULT:12;
      uint64_t THCMPRANGE:2;
      uint64_t THCMPCROSS:2;
      uint64_t reservedSpace1:6;
      uint64_t CHANNEL:4;
      uint64_t OVERRUN:1;
      uint64_t DATAVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAT_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t RESULT:12;
      uint64_t THCMPRANGE:2;
      uint64_t THCMPCROSS:2;
      uint64_t reservedSpace1:6;
      uint64_t CHANNEL:4;
      uint64_t OVERRUN:1;
      uint64_t DATAVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAT_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t RESULT:12;
      uint64_t THCMPRANGE:2;
      uint64_t THCMPCROSS:2;
      uint64_t reservedSpace1:6;
      uint64_t CHANNEL:4;
      uint64_t OVERRUN:1;
      uint64_t DATAVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAT_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t RESULT:12;
      uint64_t THCMPRANGE:2;
      uint64_t THCMPCROSS:2;
      uint64_t reservedSpace1:6;
      uint64_t CHANNEL:4;
      uint64_t OVERRUN:1;
      uint64_t DATAVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAT_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t RESULT:12;
      uint64_t THCMPRANGE:2;
      uint64_t THCMPCROSS:2;
      uint64_t reservedSpace1:6;
      uint64_t CHANNEL:4;
      uint64_t OVERRUN:1;
      uint64_t DATAVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAT_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t RESULT:12;
      uint64_t THCMPRANGE:2;
      uint64_t THCMPCROSS:2;
      uint64_t reservedSpace1:6;
      uint64_t CHANNEL:4;
      uint64_t OVERRUN:1;
      uint64_t DATAVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAT_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t RESULT:12;
      uint64_t THCMPRANGE:2;
      uint64_t THCMPCROSS:2;
      uint64_t reservedSpace1:6;
      uint64_t CHANNEL:4;
      uint64_t OVERRUN:1;
      uint64_t DATAVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAT_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t RESULT:12;
      uint64_t THCMPRANGE:2;
      uint64_t THCMPCROSS:2;
      uint64_t reservedSpace1:6;
      uint64_t CHANNEL:4;
      uint64_t OVERRUN:1;
      uint64_t DATAVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAT_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t RESULT:12;
      uint64_t THCMPRANGE:2;
      uint64_t THCMPCROSS:2;
      uint64_t reservedSpace1:6;
      uint64_t CHANNEL:4;
      uint64_t OVERRUN:1;
      uint64_t DATAVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAT_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t RESULT:12;
      uint64_t THCMPRANGE:2;
      uint64_t THCMPCROSS:2;
      uint64_t reservedSpace1:6;
      uint64_t CHANNEL:4;
      uint64_t OVERRUN:1;
      uint64_t DATAVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAT_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t THRLOW:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THR0_LOW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t THRLOW:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THR1_LOW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t THRHIGH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THR0_HIGH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t THRHIGH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THR1_HIGH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0_THRSEL:1;
      uint64_t CH1_THRSEL:1;
      uint64_t CH2_THRSEL:1;
      uint64_t CH3_THRSEL:1;
      uint64_t CH4_THRSEL:1;
      uint64_t CH5_THRSEL:1;
      uint64_t CH6_THRSEL:1;
      uint64_t CH7_THRSEL:1;
      uint64_t CH8_THRSEL:1;
      uint64_t CH9_THRSEL:1;
      uint64_t CH10_THRSEL:1;
      uint64_t CH11_THRSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_THRSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEQA_INTEN:1;
      uint64_t SEQB_INTEN:1;
      uint64_t OVR_INTEN:1;
      uint64_t ADCMPINTEN0:2;
      uint64_t ADCMPINTEN1:2;
      uint64_t ADCMPINTEN2:2;
      uint64_t ADCMPINTEN3:2;
      uint64_t ADCMPINTEN4:2;
      uint64_t ADCMPINTEN5:2;
      uint64_t ADCMPINTEN6:2;
      uint64_t ADCMPINTEN7:2;
      uint64_t ADCMPINTEN8:2;
      uint64_t ADCMPINTEN9:2;
      uint64_t ADCMPINTEN10:2;
      uint64_t ADCMPINTEN11:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THCMP0:1;
      uint64_t THCMP1:1;
      uint64_t THCMP2:1;
      uint64_t THCMP3:1;
      uint64_t THCMP4:1;
      uint64_t THCMP5:1;
      uint64_t THCMP6:1;
      uint64_t THCMP7:1;
      uint64_t THCMP8:1;
      uint64_t THCMP9:1;
      uint64_t THCMP10:1;
      uint64_t THCMP11:1;
      uint64_t OVERRUN0:1;
      uint64_t OVERRUN1:1;
      uint64_t OVERRUN2:1;
      uint64_t OVERRUN3:1;
      uint64_t OVERRUN4:1;
      uint64_t OVERRUN5:1;
      uint64_t OVERRUN6:1;
      uint64_t OVERRUN7:1;
      uint64_t OVERRUN8:1;
      uint64_t OVERRUN9:1;
      uint64_t OVERRUN10:1;
      uint64_t OVERRUN11:1;
      uint64_t SEQA_OVR:1;
      uint64_t SEQB_OVR:1;
      uint64_t reservedSpace0:2;
      uint64_t SEQA_INT:1;
      uint64_t SEQB_INT:1;
      uint64_t THCMP_INT:1;
      uint64_t OVR_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLAGS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_ENA:1;
      uint64_t ADC_INIT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STARTUP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CALIB:1;
      uint64_t CALREQD:1;
      uint64_t CALVALUE:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CALIB;

