iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC546xx/targetInit/LPC546xx_sfr.h
};

#define ADC0 (*(volatile struct ADC0_tag *) 0x400a0000)

struct USBFSH_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t REV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HcRevision;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CBSR:2;
      uint64_t PLE:1;
      uint64_t IE:1;
      uint64_t CLE:1;
      uint64_t BLE:1;
      uint64_t HCFS:2;
      uint64_t reservedSpace0:1;
      uint64_t RWC:1;
      uint64_t RWE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HcControl;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HCR:1;
      uint64_t CLF:1;
      uint64_t BLF:1;
      uint64_t OCR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HcCommandStatus;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SO:1;
      uint64_t WDH:1;
      uint64_t SF:1;
      uint64_t RD:1;
      uint64_t UE:1;
      uint64_t FNO:1;
      uint64_t RHSC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HcInterruptStatus;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SO:1;
      uint64_t WDH:1;
      uint64_t SF:1;
      uint64_t RD:1;
      uint64_t UE:1;
      uint64_t FNO:1;
      uint64_t RHSC:1;
      uint64_t reservedSpace0:23;
      uint64_t OC:1;
      uint64_t MIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HcInterruptEnable;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SO:1;
      uint64_t WDH:1;
      uint64_t SF:1;
      uint64_t RD:1;
      uint64_t UE:1;
      uint64_t FNO:1;
      uint64_t RHSC:1;
      uint64_t reservedSpace0:23;
      uint64_t OC:1;
      uint64_t MIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HcInterruptDisable;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HCCA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HcHCCA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PCED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HcPeriodCurrentED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t CHED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HcControlHeadED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t CCED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HcControlCurrentED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t BHED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HcBulkHeadED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t BCED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HcBulkCurrentED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t DH:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HcDoneHead;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FI:14;
      uint64_t reservedSpace0:2;
      uint64_t FSMPS:15;
      uint64_t FIT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HcFmInterval;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FR:4;
      uint64_t reservedSpace0:27;
      uint64_t FRT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HcFmRemaining;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HcFmNumber;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HcPeriodicStart;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LST:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HcLSThreshold;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NDP:8;
      uint64_t NPS:1;
      uint64_t PSM:1;
      uint64_t DT:1;
      uint64_t OCPM:1;
      uint64_t NOCP:1;
      uint64_t reservedSpace0:11;
      uint64_t POTPGT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HcRhDescriptorA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ield:16;
      uint64_t PPCM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HcRhDescriptorB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPS:1;
      uint64_t OCI:1;
      uint64_t reservedSpace0:13;
      uint64_t DRWE:1;
      uint64_t LPSC:1;
      uint64_t CCIC:1;
      uint64_t reservedSpace1:13;
      uint64_t CRWE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HcRhStatus;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCS:1;
      uint64_t PES:1;
      uint64_t PSS:1;
      uint64_t POCI:1;
      uint64_t PRS:1;
      uint64_t reservedSpace0:3;
      uint64_t PPS:1;
      uint64_t LSDA:1;
      uint64_t reservedSpace1:6;
      uint64_t CSC:1;
      uint64_t PESC:1;
      uint64_t PSSC:1;
      uint64_t OCIC:1;
      uint64_t PRSC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HcRhPortStatus;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:1;
      uint64_t reservedSpace0:7;
      uint64_t ID_EN:1;
      uint64_t reservedSpace1:7;
      uint64_t DEV_ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PortMode;

};

#define USBFSH (*(volatile struct USBFSH_tag *) 0x400a2000)

struct USBHSH_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPLENGTH:8;
      uint64_t reservedSpace0:8;
      uint64_t CHIPID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAPLENGTH_CHIPID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t N_PORTS:4;
      uint64_t PPC:1;
      uint64_t reservedSpace0:11;
      uint64_t P_INDICATOR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCSPARAMS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:17;
      uint64_t LPMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCCPARAMS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLADJ:6;
      uint64_t reservedSpace0:10;
      uint64_t FRINDEX:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLADJ_FRINDEX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t ATL_CUR:5;
      uint64_t ATL_BASE:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATL_PTD_BASE_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ISO_FIRST:5;
      uint64_t ISO_BASE:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISO_PTD_BASE_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t INT_FIRST:5;
      uint64_t INT_BASE:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT_PTD_BASE_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DAT_BASE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_PAYLOAD_BASE_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RS:1;
      uint64_t HCRESET:1;
      uint64_t FLS:2;
      uint64_t reservedSpace0:3;
      uint64_t LHCR:1;
      uint64_t ATL_EN:1;
      uint64_t ISO_EN:1;
      uint64_t INT_EN:1;
      uint64_t reservedSpace1:13;
      uint64_t HIRD:4;
      uint64_t LPM_RWU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USBCMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PCD:1;
      uint64_t FLR:1;
      uint64_t reservedSpace1:12;
      uint64_t ATL_IRQ:1;
      uint64_t ISO_IRQ:1;
      uint64_t INT_IRQ:1;
      uint64_t SOF_IRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USBSTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PCDE:1;
      uint64_t FLRE:1;
      uint64_t reservedSpace1:12;
      uint64_t ATL_IRQ_E:1;
      uint64_t ISO_IRQ_E:1;
      uint64_t INT_IRQ_E:1;
      uint64_t SOF_E:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USBINTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCS:1;
      uint64_t CSC:1;
      uint64_t PED:1;
      uint64_t PEDC:1;
      uint64_t OCA:1;
      uint64_t OCC:1;
      uint64_t FPR:1;
      uint64_t SUSP:1;
      uint64_t PR:1;
      uint64_t SUS_L1:1;
      uint64_t LS:2;
      uint64_t PP:1;
      uint64_t reservedSpace0:1;
      uint64_t PIC:2;
      uint64_t PTC:4;
      uint64_t PSPD:2;
      uint64_t WOO:1;
      uint64_t SUS_STAT:2;
      uint64_t DEV_ADD:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTSC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ATL_DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATL_PTD_DONE_MAP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ATL_SKIP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATL_PTD_SKIP_MAP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISO_DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISO_PTD_DONE_MAP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISO_SKIP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISO_PTD_SKIP_MAP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT_PTD_DONE_MAP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_SKIP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT_PTD_SKIP_MAP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ATL_LAST:5;
      uint64_t reservedSpace0:3;
      uint64_t ISO_LAST:5;
      uint64_t reservedSpace1:3;
      uint64_t INT_LAST:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LAST_PTD_INUSE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PHY_ADDR:8;
      uint64_t PHY_WDATA:8;
      uint64_t PHY_RDATA:8;
      uint64_t PHY_RW:1;
      uint64_t PHY_ACCESS:1;
      uint64_t reservedSpace0:5;
      uint64_t PHY_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UTMIPLUS_ULPI_DEBUG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID0:1;
      uint64_t reservedSpace0:7;
      uint64_t ID0_EN:1;
      uint64_t reservedSpace1:7;
      uint64_t DEV_ENABLE:1;
      uint64_t reservedSpace2:1;
      uint64_t SW_CTRL_PDCOM:1;
      uint64_t SW_PDCOM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTMODE;

};

#define USBHSH (*(volatile struct USBHSH_tag *) 0x400a3000)

